{  
    "BTC":{  
       "ccId":"1182",
       "currency":"Bitcoin",
       "symbol":"BTC",
       "description":"Bitcoin uses peer-to-peer technology to operate with no central authority or banks; managing transactions and the issuing of bitcoins is carried out collectively by the network. Although other cryptocurrencies have come before, Bitcoin is the first decentralized cryptocurrency - Its reputation has spawned copies and evolution in the space.  Bitcoin is one of the first digital currencies to use peer-to-peer technology to facilitate instant payments. The independent individuals and companies who own the governing computing power and participate in the Bitcoin network, also known as miners, are motivated by rewards (the release of new bitcoin) and transaction fees paid in bitcoin. These miners can be thought of as the decentralized authority enforcing the credibility of the Bitcoin network. New bitcoin is being released to the miners at a fixed, but periodically declining rate, such that the total supply of bitcoins approaches 21 million.",
       "features":"The block chain is a shared public ledger on which the entire Bitcoin network relies. All confirmed transactions are included in the block chain. This way, Bitcoin wallets can calculate their spendable balance and new transactions can be verified to be spending bitcoins that are actually owned by the spender. The integrity and the chronological order of the block chain are enforced with cryptography.Transactions - private keys A transaction is a transfer of value between Bitcoin wallets that gets included in the block chain. Bitcoin wallets keep a secret piece of data called a private key or seed, which is used to sign transactions, providing a mathematical proof that they have come from the owner of the wallet. The signature also prevents the transaction from being altered by anybody once it has been issued. All transactions are broadcast between users and usually begin to be confirmed by the network in the following 10 minutes, through a process called mining.Processing - mining Mining is a distributed consensus system that is used to confirm waiting transactions by including them in the block chain. It enforces a chronological order in the block chain, protects the neutrality of the network, and allows different computers to agree on the state of the system. To be confirmed, transactions must be packed in a block that fits very strict cryptographic rules that will be verified by the network. These rules prevent previous blocks from being modified because doing so would invalidate all following blocks. Mining also creates the equivalent of a competitive lottery that prevents any individual from easily adding new blocks consecutively in the block chain. This way, no individuals can control what is included in the block chain or replace parts of the block chain to roll back their own spends.",
       "assetType":"",
       "hashAlgorithm":"SHA256",
       "proofType":"PoW",
       "totalCoinSupply":"21000000",
       "whitepaper":"https://bitcoin.org/bitcoin.pdf",
       "startDate":"03/01/2009",
       "website":"https://bitcoin.org/en/",
       "netHashesPerSecond":21528020746.245068,
       "totalCoinsMined":"16886750.0",
       "twitter":{  
       },
       "reddit":{  
          "subscribers":751775,
          "activeUsers":9744,
          "link":"https://www.reddit.com/r/bitcoin/"
       },
       "facebook":{  
          "likes":37257,
          "link":"https://www.facebook.com/bitcoins/"
       },
       "code":{  
          "stars":2063,
          "language":"Java",
          "lastUpdate":"1519578581",
          "link":"https://github.com/bitcoinj/bitcoinj"
       }
    },
    "ETH":{  
       "ccId":"7605",
       "currency":"Ethereum",
       "symbol":"ETH",
       "description":"Launched in 2015, Ethereum is the world's most popular decentralized software platform, enabling the creation of Smart Contracts and Distributed Applications (ĐApps) that can be built and run without any downtime, fraud, control or interference from a third party. Ethereum is not just a platform but is also a programming language (Turing complete) running on a blockchain, and is helping developers to build and publish distributed applications. The applications on Ethereum are run on its platform-specific cryptographic token, ether. Ether is a vehicle for transactions on the Ethereum platform, and is sought by mostly developers looking to develop and run applications inside Ethereum. Ether is used broadly for two purposes, it is traded as a digital currency exchange like other cryptocurrencies and is used inside Ethereum to run applications and even to monetize work. Ethereum serves as the technical underpinning of the digital token concept, which under the ERC20 token protocol has allowed hundreds of blockchain startups to launch their own crtypocurrency tokens in an ICO (Initial Coin Offering).",
       "features":"Sandwich complexity model: the bottom level architecture of Ethereum should be as simple as possible, and the interfaces to Ethereum (including high level programming languages for developers and the user interface for users) should be as easy to understand as possible. Where complexity is inevitable, it should be pushed into the \"middle layers\" of the protocol, that are not part of the core consensus but are also not seen by end users - high-level-language compilers, argument serialization and deserialization scripts, storage data structure models, the leveldb storage interface and the wire protocol, etc. However, this preference is not absolute.Freedom: users should not be restricted in what they use the Ethereum protocol for, and we should not attempt to preferentially favor or disfavor certain kinds of Ethereum contracts or transactions based on the nature of their purpose. This is similar to the guiding principle behind the concept of \"net neutrality\". One example of this principle not being followed is the situation in the Bitcoin transaction protocol where use of the blockchain for \"off-label\" purposes (eg. data storage, meta-protocols) is discouraged, and in some cases explicit quasi-protocol changes (eg. OP_RETURN restriction to 40 bytes) are made to attempt to attack applications using the blockchain in \"unauthorized\" ways. In Ethereum, we instead strongly favor the approach of setting up transaction fees in such a way as to be roughly incentive-compatible, such that users that use the blockchain in bloat-producing ways internalize the cost of their activities (ie. Pigovian taxation).Generalization: protocol features and opcodes in Ethereum should embody maximally low-level concepts, so that they can be combined in arbitrary ways including ways that may not seem useful today but which may become useful later, and so that a bundle of low-level concepts can be made more efficient by stripping out some of its functionality when it is not necessary. An example of this principle being followed is our choice of a LOG opcode as a way of feeding information to (particularly light client) dapps, as opposed to simply logging all transactions and messages as was internally suggested earlier - the concept of \"message\" is really the agglomeration of multiple concepts, including \"function call\" and \"event interesting to outside watchers\", and it is worth separating the two.Have No Features: as a corollary to generalization, the dev team often refuses to build in even very common high-level use cases as intrinsic parts of the protocol, with the understanding that if people really want to do it they can always create a sub-protocol (eg. ether-backed subcurrency, bitcoin/litecoin/dogecoin sidechain, etc) inside of a contract. An example of this is the lack of a Bitcoin-like \"locktime\" feature in Ethereum, as such a feature can be simulated via a protocol where users send \"signed data packets\" and those data packets can be fed into a specialized contract that processes them and performs some corresponding function if the data packet is in some contract-specific sense valid.Non-risk-aversion: the dev team is okay with higher degrees of risk if a risk-increasing change provides very substantial benefits (eg. generalized state transitions, 50x faster block times, consensus efficiency, etc)",
       "assetType":"",
       "hashAlgorithm":"Ethash",
       "proofType":"PoW",
       "totalCoinSupply":"0",
       "whitepaper":"https://github.com/ethereum/wiki/wiki/White-Paper",
       "startDate":"30/07/2015",
       "website":"https://www.ethereum.org/",
       "netHashesPerSecond":228970564876200.88,
       "totalCoinsMined":"97846365.0",
       "twitter":{  
          "followers":367667,
          "link":"https://twitter.com/ethereumproject"
       },
       "reddit":{  
          "subscribers":331457,
          "activeUsers":3296,
          "link":"https://www.reddit.com/r/ethereum/"
       },
       "facebook":{  
          "likes":134831,
          "link":"https://www.facebook.com/ethereumproject/"
       },
       "code":{  
          "stars":14318,
          "language":"Go",
          "lastUpdate":"1519588646",
          "link":"https://github.com/ethereum/go-ethereum"
       }
    },
    "XRB":{  
       "ccId":"172091",
       "currency":"Nano",
       "symbol":"XRB",
       "description":"Nano, formerly known as Raiblocks, is designed to be a low latency, high throughput cryptocurrency. In the Nano system, each account in the system has a block chain that is controlled only by them, all chains are replicated to all peers in the network, removing block intervals, mining, transaction fees.  This system relies on a block-lattice architecture that is novel with each account having its own blockchain. Consensus comes from the delegated proof of stake (PoS) voting. With Nano, users get unlimited scalability plus instantaneous transactions without fees. That lack of fees is possible thanks to the minimal resources required by the network, including no requirement for high-power mining hardware. According to its website, the Nano network so far has processed more than 4 million transactions.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Blake2b",
       "proofType":"PoW",
       "totalCoinSupply":"340282367",
       "whitepaper":"https://raiblocks.net/media/RaiBlocks_Whitepaper__English.pdf",
       "startDate":"29/02/2016",
       "website":"https://nano.org/en",
       "netHashesPerSecond":0,
       "totalCoinsMined":"133248289.0",
       "twitter":{  
          "followers":840,
          "link":"https://twitter.com/nanocurrency"
       },
       "reddit":{  
          "subscribers":52129,
          "activeUsers":2549,
          "link":"https://www.reddit.com/r/nanocurrency/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":1775,
          "language":"C++",
          "lastUpdate":"1519572968",
          "link":"https://github.com/nanocurrency/raiblocks"
       }
    },
    "LTC":{  
       "ccId":"3808",
       "currency":"Litecoin",
       "symbol":"LTC",
       "description":"Litecoin LTC - provides faster transaction confirmations (2.5 minutes on average) and uses a memory-hard, scrypt-based mining proof-of-work algorithm to target the regular computers and GPUs most people already have - which are its main differentials to Bitcoin. The Litecoin network is scheduled to produce 84 million currency units with a halving in reward every four years just like bitcoin. The coin was created by a Google employee, Charles Lee. Litecoin is in second spot to Bitcoin and has spawned numerous clones - however it has a solid base of support and dedicated development team.The Litecoin project is currently maintained by a core group of 6 software developers, led by Charles Lee, with a large community that is growing in support.In May 2017, Litecoin became the first of the Top 5 (By Market Cap) cryptocurrencies to implement the SegWit scaling solution. Later in May of the same year, the first Lightning Network transaction was completed through litecoin, transferring 0.00000001 LTC from Zurich to San Francisco in under one second.",
       "features":"- Faster transaction confirmations (2.5 minutes on average)- Scrypt-based mining proof-of-work algorithm- 84 million litecoins- Higher transaction volume than Bitcoin- MIT/X11 license ",
       "assetType":"",
       "hashAlgorithm":"Scrypt",
       "proofType":"PoW",
       "totalCoinSupply":"84000000",
       "whitepaper":"",
       "startDate":"13/10/2011",
       "website":"https://litecoin.com",
       "netHashesPerSecond":154614863682121.1,
       "totalCoinsMined":"55381758.0",
       "twitter":{  
          "followers":397207,
          "link":"https://twitter.com/litecoin"
       },
       "reddit":{  
          "subscribers":192895,
          "activeUsers":3598,
          "link":"https://www.reddit.com/r/litecoin/"
       },
       "facebook":{  
          "likes":7865,
          "link":"https://www.facebook.com/litecoincommunity/"
       },
       "code":{  
          "stars":2864,
          "language":"C++",
          "lastUpdate":"1519570782",
          "link":"https://github.com/litecoin-project/litecoin"
       }
    },
    "DGD":{  
       "ccId":"18907",
       "currency":"Digix DAO",
       "symbol":"DGD",
       "description":"Digix DAO is a new form of cryptographic asset in that it is a Decentralised Autonomous Organisation or DAO for short. DAO are basically Companies written in code that are there to perform a set of functions with holders of the tokens voting in relation to the number of tokens they hold. The Digix DAO gives users the right to profits in the trading of Digix tokens (DGX) which own the right to gold stored in vault in Singapore. So if people trade 20 gold bars per day - the Digix DAO token holders will have the profits of the commission from those trades distributed equally amongst themselves.",
       "features":"The DAO token is built on ethereum. The ICO - or initial coin offering - raised $5.5million to acquire the 85% of the DGD tokens. ",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1999421",
       "whitepaper":"https://digix.global/whitepaper.pdf",
       "startDate":"28/04/2016",
       "website":"https://www.dgx.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"2000000.0",
       "twitter":{  
          "followers":11289,
          "link":"https://twitter.com/DigixGlobal"
       },
       "reddit":{  
          "subscribers":2525,
          "activeUsers":1735,
          "link":"https://www.reddit.com/r/digix/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "NEO":{  
       "ccId":"27368",
       "currency":"NEO",
       "symbol":"NEO",
       "description":"NEO is a platform in which users can issue and trade assets. NEO has been rebranded from the original Antshares. NEO is the first decentralized, open-source cryptocurrency and blockchain platform launched in China.  NEO tokenizes proofs of ownership of an asset and not the asset itself, thus taking into account all of the legal complications and obligations that may come with the transfer of shares, equity and assets. The base asset of the NEO blockchain is the non-divisible NEO token which generates GAS tokens that can be used to pay for transaction fees generated by applications on the network. NEO uses a delegated Byzantine Fault Tolerance (dBFT) consensus mechanism and can support up to 10,000 transactions per second.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"http://docs.neo.org/en-us/",
       "startDate":"01/01/0001",
       "website":"https://neo.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"65000000.0",
       "twitter":{  
          "followers":279368,
          "link":"https://twitter.com/neo_blockchain"
       },
       "reddit":{  
          "subscribers":82896,
          "activeUsers":5152,
          "link":"https://www.reddit.com/r/NEO/"
       },
       "facebook":{  
          "likes":945,
          "link":"https://www.facebook.com/antshares/"
       },
       "code":{  
          "stars":2002,
          "language":"C#",
          "lastUpdate":"1519569516",
          "link":"https://github.com/neo-project/neo"
       }
    },
    "XEM": {
        "ccId": "27367",
        "currency": "NEM",
        "symbol": "XEM",
        "description": "NEM is a peer-to-peer cryptocurrency and blockchain platform launched on March 31, 2015. Written in Java, with a C++ version in the works, NEM has a stated goal of a wide distribution model and has introduced new features to blockchain technology such as its proof-of-importance (POI) algorithm, multisignature accounts, encrypted messaging, and an Eigentrust++ reputation system. The NEM blockchain software is used in a commercial blockchain called Mijin, which is being tested by financial institutions and private companies in Japan and internationally.",
        "features": "",
        "assetType": "",
        "hashAlgorithm": "N/A",
        "proofType": "PoI",
        "totalCoinSupply": "8999999999",
        "whitepaper": "https://nem.io/wp-content/themes/nem/files/NEM_techRef.pdf",
        "startDate": "31/03/2015",
        "website": "https://neo.org/",
        "netHashesPerSecond": 0,
        "totalCoinsMined": "65000000.0",
        "twitter": {
            "followers": 197807,
            "link": "https://twitter.com/NEMofficial"
        },
        "reddit": {
            "subscribers": 16987,
            "activeUsers": 1896,
            "link": "https://www.reddit.com/r/nem/"
        },
        "facebook": {
            "likes": 20774,
            "link": "https://www.facebook.com/ourNEM/"
        },
        "code": {
            "stars": 207,
            "language": "Javascript",
            "lastUpdate": "1519569516",
            "link": "https://github.com/NemProject"
        }
    },
    "TRX":{  
       "ccId":"310829",
       "currency":"Tronix",
       "symbol":"TRX",
       "description":"Tron is a blockchain-based protocol that aims to be a content distribution platform for the digital entertainment industry, allowing each user to freely publish, store and own data, and in decentralized autonomous form, decides the distribution, subscription and push of contents and enables content creators by releasing, circulating and dealing with digital assets, thus forming a decentralized content entertainment ecosystem. Tronix is an ERC20 token based on the Ethereum blockchain, acting as the basic unit of account on the platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000000",
       "whitepaper":"https://o836fhe91.qnssl.com/tron/whitebook/TronWhitepaper_en.pdf",
       "startDate":"26/09/2017",
       "website":"https://tron.network/en.html",
       "netHashesPerSecond":0,
       "totalCoinsMined":"65748192475.0",
       "twitter":{  
          "followers":259956,
          "link":"https://twitter.com/tronfoundation"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":24629,
          "link":"https://www.facebook.com/tronfoundation/"
       },
       "code":{  
 
       }
    },
    "VEN":{  
       "ccId":"236131",
       "currency":"Vechain",
       "symbol":"VEN",
       "description":"VeChain is a blockchain-based platform that aims to improve the day-to-day business operations and real-time tracking of various business processes and products.  By utilizing tamper-proof and distributed ledger technology, VeChain provides retailers and consumers with the ability to determine the quality and authenticity of products that are bought. From product source materials, to servicing history, and spare part replacements, every single piece of information about the supply chain movement of a product can be recorded and verified to bring about a supply chain management ecosystem that is secure for all participants. VeChain plans to achieve this secure supply chain management ecosystem via the method of asset digitization. VeChain makes use of its VeChain Identity (VID) technology, to mark and track a product. VIDs are produced using a SHA256 hash function, which generates a random hash value that corresponds to a VID. That VID can then be written into a Near Field Communication (NFC) tag, Quick Response (QR) code, or Radio Frequency Identification (RFID) tag, to be used for each product. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://cdn.vechain.com/vechain_ico_ideas_of_development_en.pdf",
       "startDate":"19/07/2017",
       "website":"https://www.vechain.com",
       "netHashesPerSecond":0,
       "totalCoinsMined":"476173805.0",
       "twitter":{  
          "followers":74465,
          "link":"https://twitter.com/vechainofficial"
       },
       "reddit":{  
          "subscribers":40531,
          "activeUsers":3169,
          "link":"https://www.reddit.com/r/Vechain/"
       },
       "facebook":{  
          "likes":3343,
          "link":"https://www.facebook.com/vechain/"
       },
       "code":{  
 
       }
    },
    "ETC":{  
       "ccId":"5324",
       "currency":"Ethereum Classic",
       "symbol":"ETC",
       "description":"Ethereum Classic is an attempt at keeping the Ethereum blockchain unaltered by the part of the community that opposed the hard fork and the return of The DAO funds. It started trading on Poloniex and is getting more and more traction.The Ethereum Classic mission statement is:\"We believe in decentralized, censorship-resistant, permissionless blockchains. We believe in the original vision of Ethereum as a world computer you can&#39;t shut down, running irreversible smart contracts. We believe in a strong separation of concerns, where system forks are only possible in order to correct actual platform bugs, not to bail out failed contracts and special interests. We believe in censorship-resistant platform that can be actually trusted - by anyone.\"Our block explorer data: total coins supply, total network hash rate, last block number and total difficulty are freely provided by https://gastracker.io/In 2017, the Die Hard fork was implemented in ETC, removing the Ethereum difficulty bomb. Currently, there are no plans to move to Proof of Stake like Ethereum, although developers at the IOHK institute are developing a new PoS protocol for Ethereum Classic.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Ethash",
       "proofType":"PoW",
       "totalCoinSupply":"N/A",
       "whitepaper":"",
       "startDate":"23/07/2016",
       "website":"http://www.ethereumclassic.org",
       "netHashesPerSecond":12532710357364,
       "totalCoinsMined":"100123430.0",
       "twitter":{  
          "followers":21206,
          "link":"https://twitter.com/EthereumClassic"
       },
       "reddit":{  
          "subscribers":16903,
          "activeUsers":2150,
          "link":"https://www.reddit.com/r/EthereumClassic/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "XRP":{  
       "ccId":"5031",
       "currency":"Ripple",
       "symbol":"XRP",
       "description":"Ripple is a centralized real-time gross settlement system (RTGS), currency exchange and remittance network created by the Ripple company. Also called the Ripple Transaction Protocol (RTXP) or Ripple protocol, it is built upon a distributed open source internet protocol, consensus ledger and native cryptocurrency abbreviated as XRP (ripples). Released in 2012, Ripple purports to enable secure, instantly and nearly free global financial transactions of any size with no chargebacks. It supports tokens representing fiat currency, cryptocurrency, commodity or any other unit of value such as frequent flier miles or mobile minutes. At its core, Ripple is based around a shared and public database or ledger, which uses a consensus process that allows for payments, exchanges and remittance in a distributed process. Used by companies such as UniCredit, UBS and Santander, Ripple has been increasingly adopted by banks and payment networks as settlement infrastructure technology.",
       "features":"The Ledger and ConsensusThe Ripple protocol is, at its core, a shared public database. This database includes a ledger, which serves to track accounts and the balances associated with them. The ledger is a distributed database — a perfect, shared record of accounts, balances, and transactions in the Ripple protocol. It is continually and automatically updated by the Ripple Transaction Protocol (RTXP) so that an identical ledger exists on thousands of servers around the world. At any time, anybody can review the ledger and see a record of all activity on the Ripple protocol. When changes are made to the ledger, computers connected to the Ripple protocol will mutually agree to the changes via a process called consensus. The Ripple protocol reaches consensus globally within seconds of a change being made. The consensus finding process is the engineering breakthrough that allows for fast, secure, and decentralized transaction settlement on the Ripple protocol.The World’s First Distributed ExchangeNo one owns or controls the Ripple protocol. It runs on computers around the world, all working together to continually maintain a perfect, shared record of accounts, balances, and transactions. Distributed networks offer many efficiencies over centralized networks. Because the network is “self-clearing”, it eliminates the need for a centralized network operator (and gets rid of the associated layer of fees). Because there is no single point of failure, distributed networks are more reliable. They also tend to be more secure, due to their open source nature.   ",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"38305873865",
       "whitepaper":"https://ripple.com/files/ripple_solutions_guide.pdf",
       "startDate":"02/02/2013",
       "website":"https://ripple.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"39094802192.0",
       "twitter":{  
          "followers":802190,
          "link":"https://twitter.com/Ripple"
       },
       "reddit":{  
          "subscribers":179026,
          "activeUsers":3077,
          "link":"https://www.reddit.com/r/ripple/"
       },
       "facebook":{  
          "likes":115923,
          "link":"https://www.facebook.com/ripplepay/"
       },
       "code":{  
          "stars":2526,
          "language":"C++",
          "lastUpdate":"1519455853",
          "link":"https://github.com/ripple/rippled"
       }
    },
    "ICX":{  
       "ccId":"324068",
       "currency":"ICON Project",
       "symbol":"ICX",
       "description":"The ICON Project is a decentralized transactions network. The ICON Project aims to connect independent blockchains with different governance, so that they can transact with one another without intermediaries. ICX is a loopchain-based smart contract digital protocol that facilitates, verifies, and enacts a negotiated agreement between consenting parties within ICON.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"LFT",
       "totalCoinSupply":"400230000",
       "whitepaper":"http://docs.icon.foundation/ICON-Whitepaper-EN-Draft-4.8.pdf",
       "startDate":"24/10/2017",
       "website":"https://www.icon.foundation/en/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"386442514.0",
       "twitter":{  
          "followers":78333,
          "link":"https://twitter.com/helloiconworld"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":5064,
          "link":"https://www.facebook.com/helloicon/"
       },
       "code":{  
          "stars":150,
          "language":"Python",
          "lastUpdate":"1519497430",
          "link":"https://github.com/theloopkr/loopchain"
       }
    },
    "GTO":{  
       "ccId":"517477",
       "currency":"GIFTO",
       "symbol":"GTO",
       "description":"The GIFTO Protocol is a decentralized universal gifting protocol for 2.2 billion digital content consumption market. GIFTO Protocol allows for the creation and exchange of virtual gifts, built on smart contracts and blockchain technology, that in turn will create a decentralized consumer-driven virtual economic system. Users can Send and Receive GIFTO, the platform&#39;s ERC20 token, on any Social Media Platform",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://gifto.io/GIFTO_Whitepaper_V2.0_20171204.pdf",
       "startDate":"14/12/2017",
       "website":"https://gifto.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":10872,
          "link":"https://twitter.com/GIFTO_io"
       },
       "reddit":{  
          "subscribers":0,
          "activeUsers":0,
          "link":"https://www.reddit.com/r/GIFTO-io/"
       },
       "facebook":{  
          "likes":6741,
          "link":"https://www.facebook.com/gifto.io/"
       },
       "code":{  
          "stars":4,
          "language":"null",
          "lastUpdate":"1518772044",
          "link":"https://github.com/gifto-io/GiftoSmartContract"
       }
    },
    "MTL":{  
       "ccId":"179164",
       "currency":"Metal",
       "symbol":"MTL",
       "description":"Metal is a blockchain-based system utilizing Proof-of-Processed-Payments to identify users, rewarding them for converting legacy fiat currency into cryptocurrency, acting as a bridge to the cryptocurrency world. Metal's system uses provable payments attached to verified identities to distribute currency. Anyone can participate to earn METAL as a reward for converting fiat to cryptocurrency. The Metal project aims to provide all of the financial services small to medium sized businesses (SMB) might need.The MTL token is the native currency within the Metal system and it is distributed through a Proof of Processed Payments (PoPP) in which users earn MTL for sending money or making purchases.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoPP",
       "totalCoinSupply":"66588888",
       "whitepaper":"",
       "startDate":"09/06/2017",
       "website":"https://www.metalpay.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":66588888,
       "twitter":{  
          "followers":30429,
          "link":"https://twitter.com/metalpaysme"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":1942,
          "link":"https://www.facebook.com/metalpaysme/"
       },
       "code":{  
 
       }
    },
    "ADA":{  
       "ccId":"321992",
       "currency":"Cardano",
       "symbol":"ADA",
       "description":"Cardano is home to the Ada cryptocurrency, which can be used to send and receive digital funds. This digital cash represents the future of money, making possible fast, direct transfers that are guaranteed to be secure through the use of cryptography. Cardano is a technological platform that will be capable of running financial applications currently used every day by individuals, organisations and governments all around the world. The platform is being constructed in layers, which gives the system the flexibility to be more easily maintained and allow for upgrades by way of soft forks. After the settlement layer that will run Ada is complete, a separate computing layer will be built to handle smart contracts, the digital legal agreements that will underpin future commerce and business. Cardano will also run decentralised applications, or dapps, services not controlled by any single party but instead operate on a blockchain.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Ouroboros",
       "proofType":"PoS",
       "totalCoinSupply":"45000000000",
       "whitepaper":"https://www.cardano.org/en/academic-papers/",
       "startDate":"01/01/0001",
       "website":"https://www.cardanohub.org",
       "netHashesPerSecond":0,
       "totalCoinsMined":"25927070538.0",
       "twitter":{  
          "followers":101894,
          "link":"https://twitter.com/cardanocom"
       },
       "reddit":{  
          "subscribers":56455,
          "activeUsers":2406,
          "link":"https://www.reddit.com/r/cardano/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":2093,
          "language":"Haskell",
          "lastUpdate":"1519571492",
          "link":"https://github.com/input-output-hk/cardano-sl"
       }
    },
    "BNB":{  
       "ccId":"204788",
       "currency":"Binance Coin",
       "symbol":"BNB",
       "description":"The Binance Coin is an Ethereum-based token that allows users to receive a discount for any fees on the Binance platform, a pure cryptocurrency exchange that plans to create a decentralized exchange for blockchain assets. BNB also gives users access to special features and will be used to power the upcoming decentralized exchange.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"200000000",
       "whitepaper":"",
       "startDate":"27/06/2017",
       "website":"https://www.binance.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"99014000.0",
       "twitter":{  
          "followers":659624,
          "link":"https://twitter.com/binance_2017"
       },
       "reddit":{  
          "subscribers":40195,
          "activeUsers":2472,
          "link":"https://www.reddit.com/r/binance/"
       },
       "facebook":{  
          "likes":52802,
          "link":"https://www.facebook.com/binanceexchange/"
       },
       "code":{  
 
       }
    },
    "LSK":{  
       "ccId":"19745",
       "currency":"Lisk",
       "symbol":"LSK",
       "description":"Lisk is a crypto-currency and decentralized application platform. As a crypto-currency, much like Bitcoin and other alternatives, it provides a decentralized payment system and digital money network. The network itself, operates using a highly efficient Delegated-Proof-of-Stake (DPoS) consensus model, that is secured by 101 democratically elected delegates. The Lisk decentralized application platform, it's most powerful component, allows the deployment, distribution and monetisation of decentralized applications and custom blockchains (sidechains) onto the Lisk blockchain. The inflation rate is 5 LISK per block, which gets lowered by 1 every year until it reaches a stable block reward of 1 LISK per block. Lisk partnered with Microsoft to integrate Lisk into its Azure Blockchain as a Service (BaaS) program — meaning developers worldwide can develop, test, and deploy Lisk blockchain applications using Microsoft's Azure cloud computing platform and infrastructure.",
       "features":"During the ICO 100,000,000 LISK weree goven out to ICO participants, the core team, third parties and active community members. Once the network is established with 101 delegates there will be an inflation of 5 newly created LISK with every block, these are the Forging Rewards. Every 3,000,000 blocks (~1 year) this reward is reduced by 1 LISK, ending at 1 LISK per block where it stays like that forever.The Forging Rewards will be equally distributed through all active (101 and higher) delegates, same as the network fees. We implemented this mechanism to create an incentive to run a delegate and secure the network. Additionally, this allows Lisk to finance itself in the future. Lisk is written in JavaScript utilizing NodeJS.",
       "assetType":"",
       "hashAlgorithm":"DPoS",
       "proofType":"DPoS",
       "totalCoinSupply":"159918400",
       "whitepaper":"",
       "startDate":"24/05/2016",
       "website":"https://lisk.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":"102238920.0",
       "twitter":{  
          "followers":179292,
          "link":"https://twitter.com/LiskHQ "
       },
       "reddit":{  
          "subscribers":28111,
          "activeUsers":2239,
          "link":"https://www.reddit.com/r/Lisk/"
       },
       "facebook":{  
          "likes":25794,
          "link":"https://www.facebook.com/LiskHQ/"
       },
       "code":{  
          "stars":1992,
          "language":"JavaScript",
          "lastUpdate":"1519581015",
          "link":"https://github.com/LiskHQ/lisk"
       }
    },
    "XLM":{  
       "ccId":"4614",
       "currency":"Stellar",
       "symbol":"XLM",
       "description":"Stellar is an open-source protocol for exchanging money. Servers run a software implementation of the protocol, and use the Internet to connect to and communicate with other Stellar servers, forming a global value exchange network. Each server stores a record of all “accounts” on the network. These records are stored in a database called the “ledger”. Servers propose changes to the ledger by proposing “transactions”, which move accounts from one state to another by spending the account’s balance or changing a property of the account. All of the servers come to agreement on which set of transactions to apply to the current ledger through a process called “consensus”. The consensus process happens at a regular interval, typically every 2 to 4 seconds. This keeps each server’s copy of the ledger in sync and identical. Stellar is planning to compensate for the drawbacks of Ethereum by upgrading its platform to Stellar XLM.  Because of the efficient global network provided by XLM, a cross-border transaction has come within the grasp of every cryptocurrency traders. The Stellar protocol allows the traders to exchange money from one country to another for a very low cost and with lightning-fast speed. The quality of this service is one of the main reasons behind its increasing popularity.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100804167793",
       "whitepaper":"https://www.stellar.org/papers/stellar-consensus-protocol.pdf",
       "startDate":"19/07/2013",
       "website":"https://www.stellar.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"18467830630.0",
       "twitter":{  
          "followers":211620,
          "link":"https://twitter.com/stellarorg"
       },
       "reddit":{  
          "subscribers":72652,
          "activeUsers":2762,
          "link":"https://www.reddit.com/r/stellar/"
       },
       "facebook":{  
          "likes":16268,
          "link":"https://www.facebook.com/stellarfoundation/"
       },
       "code":{  
          "stars":1317,
          "language":"C",
          "lastUpdate":"1519554296",
          "link":"https://github.com/stellar/stellar-core"
       }
    },
    "APPC":{  
       "ccId":"346812",
       "currency":"AppCoins",
       "symbol":"APPC",
       "description":"AppCoins is a cryptocurrency for app stores that gives users new app purchasing power, unleashes monetization potential for developers and increases app safety.This project provides developers a transparent and efficient way to monetise their apps and build a reputation across app stores; provides users a trusted environment with new purchasing possibilities and incentives to discover apps; and creates an app economy with a new universal language that ensures trust, transparency, and openness.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"246203093",
       "whitepaper":"",
       "startDate":"06/11/2017",
       "website":"https://appcoins.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":246203093.00000003,
       "twitter":{  
          "followers":24669,
          "link":"https://twitter.com/AppCoinsProject"
       },
       "reddit":{  
          "subscribers":3610,
          "activeUsers":59,
          "link":"https://www.reddit.com/r/AppcoinsProtocol/"
       },
       "facebook":{  
          "likes":10628,
          "link":"https://www.facebook.com/AppCoinsOfficial/"
       },
       "code":{  
 
       }
    },
    "HSR":{  
       "ccId":"318199",
       "currency":"Hshare",
       "symbol":"HSR",
       "description":"Hshare is a dual network blockchain comprised both of a blockchain-based network and a DAG-based network. It allows for anonymous transactions through the use of zero proof technology. The blockchain-based side of Hshare features a PoW/PoS cryptocurrency.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"84000000",
       "whitepaper":"https://h.cash/themes/en/dist/pdf/Hcash+Whitepaper+V0.8.1.pdf",
       "startDate":"02/10/2017",
       "website":"https://h.cash/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"42669992.0",
       "twitter":{  
          "followers":3908,
          "link":"https://twitter.com/Mkt_Hcash"
       },
       "reddit":{  
          "subscribers":0,
          "activeUsers":0,
          "link":"https://www.reddit.com/r/H_cash/"
       },
       "facebook":{  
          "likes":1426,
          "link":"https://www.facebook.com/HcashOfficial/"
       },
       "code":{  
          "stars":101,
          "language":"C",
          "lastUpdate":"1519140483",
          "link":"https://github.com/HcashOrg/Hshare"
       }
    },
    "EOS":{  
       "ccId":"166503",
       "currency":"EOS",
       "symbol":"EOS",
       "description":"EOS.IO is software that introduces a blockchain architecture designed to enable vertical and horizontal scaling of decentralized applications (the “EOS.IO Software”). This is achieved through an operating system-like construct upon which applications can be built. The software provides accounts, authentication, databases, asynchronous communication and the scheduling of applications across multiple CPU cores and/or clusters. The resulting technology is a blockchain architecture that has the potential to scale to millions of transactions per second, eliminates user fees and allows for quick and easy deployment of decentralized applications.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"DPoS",
       "proofType":"DPoS",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://github.com/EOSIO/Documentation/blob/master/TechnicalWhitePaper.md",
       "startDate":"26/06/2017",
       "website":"https://eos.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"692464968.0",
       "twitter":{  
          "followers":115292,
          "link":"https://twitter.com/eos_io"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":7693,
          "link":"https://www.facebook.com/eosblockchain/"
       },
       "code":{  
 
       }
    },
    "BCH":{  
       "ccId":"202330",
       "currency":"Bitcoin Cash / BCC",
       "symbol":"BCH",
       "description":"Bitcoin Cash (BCH) is a hard forked version of the original Bitcoin. It is similar to bitcoin with regards to its protocol; Proof of Work SHA-256 hashing, 21,000,000 supply, same block times and reward system. However two main differences are the the blocksize limits, as of August 2017 Bitcoin has a 1MB blocksize limit whereas BCH proposes 8MB blocks. Also BCH will adjust the difficulty every 6 blocks as opposed to 2016 blocks as with Bitcoin. Bitcoin Cash is a proposal from the viaBTC mining pool and the Bitmain mining group to carry out a UAHF (User Activated Hard Fork) on August 1st 12:20 pm UTC. They rejected the agreed consensus (aka BIP-91 or SegWit2x) and have decided to fork the original Bitcoin blockchain and create this new version of Bitcoin",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"SHA256",
       "proofType":"PoW",
       "totalCoinSupply":"21000000",
       "whitepaper":"",
       "startDate":"01/08/2017",
       "website":"https://www.bitcoincash.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"16987600.0",
       "twitter":{  
 
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "REQ":{  
       "ccId":"335059",
       "currency":"Request Network",
       "symbol":"REQ",
       "description":"Request is a decentralized network that allows anyone to request a payment for which the recipient can pay in a secure way. All of the information is stored in a decentralized authentic ledger. This results in cheaper, easier, and more secure payments, and it allows for a wide range of automation possibilities.  REQ tokens are ERC20 tokens that allow members to participate in the network, create advanced requests and reward several parties who contribute in building the request ecosystem. To the participants, a fee will be charged in REQ and afterward be burned.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://request.network/assets/pdf/request_whitepaper.pdf",
       "startDate":"31/08/2017",
       "website":"https://request.network/#/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"641462769.0",
       "twitter":{  
          "followers":36563,
          "link":"https://twitter.com/RequestNetwork"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/RequestNetwork//"
       },
       "facebook":{  
          "likes":3749,
          "link":"https://www.facebook.com/TheRequestNetwork/"
       },
       "code":{  
 
       }
    },
    "XVG":{  
       "ccId":"4433",
       "currency":"Verge",
       "symbol":"XVG",
       "description":"Verge is a decentralized open-source cryptocurrency that offers anonymous transactions by obfuscating the IP address and geolocation of its users so that they are untraceable using technology including Tor and I2P. Verge Currency is a cryptocurrency designed for everyday use. It improves upon the original Bitcoin blockchain and aims to fulfill its initial purpose of providing individuals and businesses with a fast, efficient and decentralized way of making direct transactions while maintaining personal privacy.  Verge has a transparent ledger that allows anyone to view all its transactions, but protects user identities and locations by integrating both Tor and I2P to not expose IP addresses. As for the specifics of how Verge offers that anonymity, it’s an open source project that leverages Tor, which hides your IP address by encrypting your traffic and bouncing it through a chain of computers around the world, and I2P, which differs in practice but offers the same broad strokes peer-to-peer routing. And using the so-called Wraith Protocol, Verge users can make either public or private blockchain transactions.  Unlike its many peers, it doesn’t use cryptography as much to become an anonymous cryptocurrency. Instead, it uses Tor and the I2P network to achieve its goals.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Multiple",
       "proofType":"PoW",
       "totalCoinSupply":"16555000000",
       "whitepaper":"",
       "startDate":"15/02/2016",
       "website":"http://vergecurrency.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"14640958303.0",
       "twitter":{  
          "followers":259454,
          "link":"https://twitter.com/vergecurrency"
       },
       "reddit":{  
          "subscribers":5446,
          "activeUsers":9,
          "link":"https://www.reddit.com/r/verge/"
       },
       "facebook":{  
          "likes":29337,
          "link":"https://www.facebook.com/VERGEcurrency/"
       },
       "code":{  
          "stars":1246,
          "language":"C",
          "lastUpdate":"1519529601",
          "link":"https://github.com/vergecurrency/VERGE"
       }
    },
    "BLZ":{  
       "ccId":"752710",
       "currency":"Bluzelle",
       "symbol":"BLZ",
       "description":"Bluzelle is an Ethereum-based database service for dApps. Bluzelle's protocol allows renting individual's computer storage space to earn tokens while dApp developers use tokens to have their dApp's' data stored and managed. It is for software developers who are dissatisfied with the costs, limited scalability, and complexity of existing database systems. Bluzelle is low-cost, quick to deploy, provides utmost performance, and has a solid scalability path. Bluzelle provides enterprise-grade database services at a price for all aApp developers.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"500000000",
       "whitepaper":"https://bluzelle.com/wp-content/uploads/2017/10/Bluzelle-White-Paper-v-1.2.pdf",
       "startDate":"01/11/2017",
       "website":"https://bluzelle.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":500000000,
       "twitter":{  
          "followers":25593,
          "link":"https://twitter.com/BluzelleHQ"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":72,
          "language":"C++",
          "lastUpdate":"1519473637",
          "link":"https://github.com/bluzelle/bluzelle"
       }
    },
    "CND":{  
       "ccId":"338070",
       "currency":"Cindicator",
       "symbol":"CND",
       "description":"Cindicator creates the social and technological infrastructure needed to make effective decisions under the conditions of the high uncertainty of the new economy.  By combining a large number of diverse financial analysts and a set of machine-learning models into a single system, we are developing a Hybrid Intelligence infrastructure for the efficient management of investors’ capital in traditional financial and crypto-markets.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"2000000005",
       "whitepaper":"",
       "startDate":"03/08/2017",
       "website":"https://cindicator.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"1445976590.0",
       "twitter":{  
          "followers":36061,
          "link":"https://twitter.com/Crowd_indicator"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/Cindicator//"
       },
       "facebook":{  
          "likes":4262,
          "link":"https://www.facebook.com/crowdindicator/"
       },
       "code":{  
 
       }
    },
    "INS":{  
       "ccId":"370973",
       "currency":"INS Ecosystem",
       "symbol":"INS",
       "description":"Founded in 2017, INS Ecosystem (ins.world) is the first global decentralized platform directly connecting grocery and FMCG manufacturers and consumers. INS Ecosystem raised over $41.5M during the token sale to bring blockchain technology to one of the grocery industry, one of the most important sectors of global economy, projected to reach $8.5 trillion by 2020.  INS is developing a platform to enable direct interaction between brands and consumers. Reaching the next generation audience via data-driven mass personalisation. The team consists of a large global collective of professionals with solid industry experience.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"50000000",
       "whitepaper":"https://ins.world/INS-ICO-Whitepaper.pdf",
       "startDate":"04/12/2017",
       "website":"https://www.ins.world",
       "netHashesPerSecond":0,
       "totalCoinsMined":50000000,
       "twitter":{  
          "followers":17051,
          "link":"https://twitter.com/INS_Ecosystem"
       },
       "reddit":{  
          "subscribers":1569,
          "activeUsers":42,
          "link":"https://www.reddit.com/r/INS_Ecosystem/"
       },
       "facebook":{  
          "likes":22563,
          "link":"https://www.facebook.com/ins.ecosystem/"
       },
       "code":{  
 
       }
    },
    "IOT":{  
       "ccId":"127356",
       "currency":"IOTA",
       "symbol":"IOT",
       "description":"IOTA is an open-source distributed ledger protocol that goes beyond blockchain through its core invention of the blockless ‘Tangle’. The IOTA Tangle is a quantum-proof Directed Acyclic Graph, with no fees on transactions and no fixed limit on how many transactions can be confirmed per second in the network. Instead, throughput grows in conjunction with activity in the network; the more activity, the faster the network. Unlike blockchain architecture, IOTA has no separation between users and validators; rather, validation is an intrinsic property of using the ledger, thus avoiding centralization. IOTA is initially focused on serving as the backbone of the emerging Internet-of-Things (IoT) market.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"Tangle",
       "totalCoinSupply":"2779530283",
       "whitepaper":"https://iota.org/IOTA_Whitepaper.pdf",
       "startDate":"17/07/2016",
       "website":"https://iota.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"2779530283.0",
       "twitter":{  
          "followers":105393,
          "link":"https://twitter.com/iotatoken"
       },
       "reddit":{  
          "subscribers":107555,
          "activeUsers":3984,
          "link":"https://www.reddit.com/r/iota/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "TRIG":{  
       "ccId":"27996",
       "currency":"Blocksafe",
       "symbol":"TRIG",
       "description":"Blocksafe is a decentralized protocol for managing access to firearms. Blocksafe is being built on Lisk as a sidechain and is powered by the Trigger (TRIG) token, the native currency within the Blocksafe system.",
       "features":"",
       "assetType":"https://www.blocksafefoundation.com/assets/blocksafe_whitepaper_v.1.pdf",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"",
       "startDate":"01/01/0001",
       "website":"https://www.blocksafefoundation.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":32105578,
       "twitter":{  
          "followers":27011,
          "link":"https://twitter.com/blocksafe"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":690,
          "link":"https://www.facebook.com/blocksafefoundation/"
       },
       "code":{  
 
       }
    },
    "WTC":{  
       "ccId":"299397",
       "currency":"Waltonchain",
       "symbol":"WTC",
       "description":"Waltonchain is a cryptocurrency project leveraging the Ethereum blockchain and RFID technology. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Ethash",
       "proofType":"N/A",
       "totalCoinSupply":"70000000",
       "whitepaper":"https://www.waltonchain.org/doc/Waltonchain-whitepaper_en_20180208.pdf",
       "startDate":"27/08/2017",
       "website":"http://www.waltonchain.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"24898178.0",
       "twitter":{  
          "followers":44875,
          "link":"https://twitter.com/waltonchain"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/waltonchain//"
       },
       "facebook":{  
          "likes":886,
          "link":"https://www.facebook.com/waltonchain/"
       },
       "code":{  
 
       }
    },
    "OMG":{  
       "ccId":"187440",
       "currency":"OmiseGo",
       "symbol":"OMG",
       "description":"OmiseGO is building a decentralized exchange, liquidity provider mechanism, clearinghouse messaging network, and asset-backed blockchain gateway. OmiseGO is not owned by any single one party. Instead, it is an open distributed network of validators which enforce behavior of all participants. It uses the mechanism of a protocol token to create a proof-of-stake blockchain to enable enforcement of market activity amongst participants.Owning OMG tokens buys the right to validate this blockchain, within its consensus rules. Transaction fees on the network including payment, interchange, trading, and clearinghouse use, are given to non-faulty validators who enforce bonded contract states. The token will have value derived from the fees derived from this network, with the obligation/cost of providing validation to its users.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoS",
       "totalCoinSupply":"140245398",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/OmiseGO-Whitepaper.pdf",
       "startDate":"23/06/2017",
       "website":"https://omg.omise.co/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"102042552.0",
       "twitter":{  
          "followers":242460,
          "link":"https://twitter.com/omise_go"
       },
       "reddit":{  
          "subscribers":33522,
          "activeUsers":2746,
          "link":"https://www.reddit.com/r/omise_go/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "XMR":{  
       "ccId":"5038",
       "currency":"Monero",
       "symbol":"XMR",
       "description":"Unlike many cryptocurrencies that are derivatives of Bitcoin, Monero is based on the CryptoNight proof-of-work hash algorithm, which comes from the CryptoNote protocol. It possesses significant algorithmic differences relating to blockchain obfuscation.  By providing a high level of privacy, Monero is fungible, meaning that every unit of the currency can be substituted by another unit. This makes Monero different from public-ledger cryptocurrencies like Bitcoin, where addresses with coins previously associated with undesired activity can be blacklisted and have their coins refused by other users. In particular, the ring signatures mix the spender's input with a group of others, making it exponentially more difficult to establish a link between each subsequent transaction. Also, the stealth addresses generated for each transaction make it impossible to discover the actual destination address of a transaction by anyone else other than the sender and the receiver. Monero is designed to be resistant to application-specific integrated circuit mining, which is commonly used to mine other cryptocurrencies such as Bitcoin. It can be mined somewhat efficiently on consumer grade hardware such as x86, x86-64, ARM and GPUs.",
       "features":"Ring Signature The BasicsIn cryptography, a ring signature is a type of digital signature that can be performed by any member of a group of users that each have keys. Therefore, a message signed with a ring signature is endorsed by someone in a particular group of people. One of the security properties of a ring signature is that it should be computationally infeasible to determine which of the group members&#39; keys was used to produce the signature.For instance, a ring signature could be used to provide an anonymous signature from \"a high-ranking White House official\", without revealing which official signed the message. Ring signatures are right for this application because the anonymity of a ring signature cannot be revoked, and because the group for a ring signature can be improvised (requires no prior setup). Application to MoneroA ring signature makes use of your account keys and a number of public keys (also known as outputs) pulled from the blockchain using a triangular distribution method. Over the course of time, past outputs could be used multiple times to form possible signer participants. In a \"ring\" of possible signers, all ring members are equal and valid. There is no way an outside observer can tell which of the possible signers in a signature group belongs to your account. So, ring signatures ensure that transaction outputs are untraceable. Moreover, there are no fungibility issues with Monero given that every transaction output has plausible deniability (e.g. the network can not tell which outputs are spent or unspent).To read how Monero gives you privacy by default (unlinkability), see stealth addresses.",
       "assetType":"",
       "hashAlgorithm":"CryptoNight",
       "proofType":"PoW",
       "totalCoinSupply":"0",
       "whitepaper":"https://github.com/monero-project/research-lab/blob/master/whitepaper/whitepaper.pdf",
       "startDate":"02/06/2014",
       "website":"http://getmonero.org/",
       "netHashesPerSecond":971836969.04167,
       "totalCoinsMined":"15763366.0",
       "twitter":{  
          "followers":270465,
          "link":"https://twitter.com/monerocurrency"
       },
       "reddit":{  
          "subscribers":116273,
          "activeUsers":2650,
          "link":"https://www.reddit.com/r/monero/"
       },
       "facebook":{  
          "likes":23623,
          "link":"https://www.facebook.com/monerocurrency/"
       },
       "code":{  
          "stars":2555,
          "language":"C++",
          "lastUpdate":"1519576031",
          "link":"https://github.com/monero-project/monero"
       }
    },
    "DLT":{  
       "ccId":"220204",
       "currency":"Agrello Delta",
       "symbol":"DLT",
       "description":"Agrello has developed an AI powered interface, that allows users to easily create and manage smart-contract-based agreements which are legally binding, just like traditional contracts. The platform provides a graphical interface, templates and wizards, allowing the user to draft legally-binding multi-party contracts with just a few clicks.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"130271020",
       "whitepaper":"",
       "startDate":"16/07/2017",
       "website":"https://www.agrello.org",
       "netHashesPerSecond":0,
       "totalCoinsMined":130271020.035721,
       "twitter":{  
          "followers":13433,
          "link":"https://twitter.com/AgrelloOfficial"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":4328,
          "link":"https://www.facebook.com/agrellofoundation/"
       },
       "code":{  
 
       }
    },
    "IOST":{  
       "ccId":"716522",
       "currency":"IOS token",
       "symbol":"IOST",
       "description":"The Internet of Services (IOS) is an Ethereum-based platform that provides its users a way to exchange online services and digital goods. IOS also enables developers to deploy large scale dApps.IOS token is an ERC20 token that serves as a medium of exchange on IOS platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"21000000000",
       "whitepaper":"",
       "startDate":"20/01/2018",
       "website":"https://iost.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"6794109922.0",
       "twitter":{  
          "followers":208148,
          "link":"https://twitter.com/IOStoken"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "ADX":{  
       "ccId":"170452",
       "currency":"AdEx",
       "symbol":"ADX",
       "description":"AdEx is a decentralized Ad exchange built on the Ethereum network  Focusing on the entertainment industry and video streaming services and publishers, AdEx aims to replace the traditional digital advertising models by providing a transparent, focused solution for advertisers to collaborate with ad publishers directly, skipping middlemen fees and complications. The platform also ensures that the end user can understand and control the ads delivered to them through the use of the AdEx User Profile personalized page. The AdEx token (ADX) is used within the AdEx Platform to buy or sell advertising space and time. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://www.adex.network/adex/AdEx-Whitepaper-v.7.pdf",
       "startDate":"30/05/2017",
       "website":"https://www.adex.network/",
       "netHashesPerSecond":0,
       "totalCoinsMined":73430701,
       "twitter":{  
          "followers":51777,
          "link":"https://twitter.com/AdEx_Network"
       },
       "reddit":{  
          "subscribers":3912,
          "activeUsers":83,
          "link":"https://www.reddit.com/r/AdEx/"
       },
       "facebook":{  
          "likes":4563,
          "link":"https://www.facebook.com/AdExNetwork/"
       },
       "code":{  
          "stars":13,
          "language":"JavaScript",
          "lastUpdate":"1519036602",
          "link":"https://github.com/AdExBlockchain/adex-token"
       }
    },
    "BRD":{  
       "ccId":"543502",
       "currency":"Bread token",
       "symbol":"BRD",
       "description":"The Bread Token (BRD) provides discounts and additional services when using the popular Bread wallet app. Bread is the first cryptocurrency wallet to provide a loyalty and customer rewards program. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"88862718",
       "whitepaper":"https://d2n2g5n187q8lu.cloudfront.net/static/docs/BRD-whitepaper-EN.pdf",
       "startDate":"01/12/2017",
       "website":"https://token.breadapp.com",
       "netHashesPerSecond":0,
       "totalCoinsMined":88862718,
       "twitter":{  
          "followers":5882,
          "link":"https://twitter.com/breadtoken"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/breadwallet//"
       },
       "facebook":{  
          "likes":2471,
          "link":"https://www.facebook.com/breadapp/"
       },
       "code":{  
 
       }
    },
    "GVT":{  
       "ccId":"385952",
       "currency":"Genesis Vision",
       "symbol":"GVT",
       "description":"Genesis Vision is a private trust fund management. GVT is an Ethereum-based ERC20 token that serves as currency in Genesis Vision's ecosystem. It is used for all investment operations and profit distributions.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"4436644",
       "whitepaper":"https://genesis.vision/white-paper-eng.pdf",
       "startDate":"02/09/2017",
       "website":"https://genesis.vision/",
       "netHashesPerSecond":0,
       "totalCoinsMined":4436643.928533333,
       "twitter":{  
          "followers":14015,
          "link":"https://twitter.com/genesis_vision"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/genesisvision//"
       },
       "facebook":{  
          "likes":15403,
          "link":"https://www.facebook.com/GenesisVisionProject/"
       },
       "code":{  
 
       }
    },
    "POE":{  
       "ccId":"188811",
       "currency":"Po.et",
       "symbol":"POE",
       "description":"Po.et is an Ethereum-based decentralized ledger built to track ownership and attribution for digital creative assets. It allows users to generate immutable and timestamped titles for creative works and register their assets to the Po.et network. Po.et also gives both publishers and content creators the tools to automate the licensing process without relying on any third parties, making the process cheaper and smple.POE is an ERC20 Ethereum-based token that represents a proportional share of the the fees and revenue generated from the commercial applications built on top of the Po.et protocol, including generating content licenses and processing license payments among others.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"3141592653",
       "whitepaper":"",
       "startDate":"08/08/2017",
       "website":"https://po.et/",
       "netHashesPerSecond":0,
       "totalCoinsMined":3141592653,
       "twitter":{  
          "followers":29427,
          "link":"https://twitter.com/_poetproject"
       },
       "reddit":{  
          "subscribers":10208,
          "activeUsers":2290,
          "link":"https://www.reddit.com/r/poetproject/"
       },
       "facebook":{  
          "likes":1267,
          "link":"https://www.facebook.com/poetproject/"
       },
       "code":{  
 
       }
    },
    "PPT":{  
       "ccId":"179896",
       "currency":"Populous",
       "symbol":"PPT",
       "description":"Populous is an invoice and trade finance platform built on the Ethereum network. Populous uses XBRL, Z Score formula, Smart Contracts, Stable tokens and other technologies in the cryptoshpere to create a unique trading environment for investors and invoice sellers.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"53252246",
       "whitepaper":"https://issuu.com/cryptocurrencywhitepapers/docs/poet_whitepaper",
       "startDate":"12/04/2017",
       "website":"http://populous.co/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"37004027.0",
       "twitter":{  
          "followers":19280,
          "link":"https://twitter.com/bitpopulous"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "VIB":{  
       "ccId":"198710",
       "currency":"Viberate",
       "symbol":"VIB",
       "description":"Viberate is a platform that joins the entire live music ecosystem under one roof. Currently it acts as a database for live music, where profiles are ranked according to their online popularity. It is built and curated by the Viberate user community. Viberate's end game is to disrupt the music industry as we know it – by becoming a global talent marketplace.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"200000000",
       "whitepaper":"https://icobazaar.com/static/bee8c56553d8d0c6b7fc0bb64bacb872/Viberate.io_Whitepaper.pdf",
       "startDate":"01/01/0001",
       "website":"https://www.viberate.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":200000000,
       "twitter":{  
          "followers":26242,
          "link":"https://twitter.com/Viberate_com"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":47091,
          "link":"https://www.facebook.com/viberateOFC/"
       },
       "code":{  
 
       }
    },
    "STRAT":{  
       "ccId":"24294",
       "currency":"Stratis",
       "symbol":"STRAT",
       "description":"Stratis is the native value currency in the Stratis Platform, it fuels the creation of private and public custom blockchains for corporate use. The Stratis Platform offers a one-click deployment system for custom blockchain deployment. These blockchains can be customized to suit the companies&#39; needs, and can even be deployed to mimic the features of popular blockchains like Ethereum or Lisk, which can be tested individually or in parallel.The Stratis team will also function as a London Based consultancy agency that will help businesses to deploy the blockchain that best suits them.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"X13",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"N/A",
       "whitepaper":"https://stratisplatform.com/files/Stratis_Whitepaper.pdf",
       "startDate":"09/08/2016",
       "website":"http://www.stratisplatform.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"98755167.0",
       "twitter":{  
          "followers":132618,
          "link":"https://twitter.com/stratisplatform"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":7144,
          "link":"https://www.facebook.com/stratisplatform/"
       },
       "code":{  
 
       }
    },
    "AION":{  
       "ccId":"431235",
       "currency":"Aion",
       "symbol":"AION",
       "description":"Aion network aims to provide a multi-tier blockchain system to improve the scalability, privacy, and interoperability of the blockchain. The Aion Network is designed to support custom blockchain architectures while providing a mechanism for cross-chain interoperability.The AION token is the fuel used to create new blockchains and to monetize inter-chain bridges.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"465934586.66",
       "whitepaper":"https://aion.network/downloads/aion.network_technical-introduction_en.pdf",
       "startDate":"28/09/2017",
       "website":"https://aion.network/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"96154303.0",
       "twitter":{  
          "followers":35030,
          "link":"https://twitter.com/Aion_Network"
       },
       "reddit":{  
          "subscribers":3330,
          "activeUsers":1842,
          "link":"https://www.reddit.com/r/AionNetwork/"
       },
       "facebook":{  
          "likes":1156,
          "link":"https://www.facebook.com/AionBlockchain/"
       },
       "code":{  
          "stars":28,
          "language":"JavaScript",
          "lastUpdate":"1517198524",
          "link":"https://github.com/gonuco/aion.erc.contract"
       }
    },
    "LINK":{  
       "ccId":"309621",
       "currency":"ChainLink",
       "symbol":"LINK",
       "description":" ChainLink is a blockchain-base middleware, acting as a bridge between cryptocurrency smart contracts and off-chain resources like data feeds, various web APIs, and traditional bank account payments. This way, ChainLink allows Smart Contracts to communicate with external resources on their own. LINK is an ERC20 token based on the Ethereum Blockchain. It is used to pay ChainLink Node operators for the retrieval of data from off-chain data feeds, formatting of data into blockchain readable formats, off-chain computation, and uptime guarantees they provide as operators.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000 ",
       "whitepaper":"https://link.smartcontract.com/whitepaper",
       "startDate":"19/09/2017",
       "website":"https://link.smartcontract.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"350000000.0",
       "twitter":{  
 
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "BTS":{  
       "ccId":"5039",
       "currency":"Bitshares",
       "symbol":"BTS",
       "description":"BitShares (BTS) was first introduced in a White Paper titled “A Peer-to-Peer Polymorphic Digital Asset Exchange” by Daniel Larimer, Charles Hoskinson, and Stan Larimer. It is a brand of open-source software based on the as blockchain technology as used by Bitcoin. Unlike bitcoins, which do not produce any income for their owners, BitShare can be used to launch Decentralized Autonomous Companies (DACs) which issue shares, produce profits and distribute profits to shareholders. As such, BitShares is about making profitable companies that people want to own shares in, thus creating return for the shareholders. The first DAC launched by this proces was called BitSharesX, a decentralized asset exchange based in Hong Kong. BitShares was originally launched under the name of ProtoShares (PTS); it was later renamed to BitShares (BTS) and \"reloaded\" in November 2014 by merging several products into BitShares (BTS).   ",
       "features":"Delegated Proof-of-Stake ConsensusDelegated Proof of Stake (DPOS) is a new method of securing a crypto-currency’s network. DPOS attempts to solve the problems of both Bitcoin’s traditional Proof of Work system, and the Proof of Stake system of Peercoin and NXT. DPOS implements a layer of technological democracy to offset the negative effects of centralization.Delegated proof of stake mitigates the potential negative impacts of centralization through the use of witnesses (formaly called delegates). A total of N witnesses sign the blocks and are voted on by those using the network with every transaction that gets made. By using a decentralized voting process, DPOS is by design more democratic than comparable systems. Rather than eliminating the need for trust all together, DPOS has safeguards in place the ensure that those trusted with signing blocks on behalf of the network are doing so correctly and without bias. Additionally, each block signed must have a verification that the block before it was signed by a trusted node. DPOS eliminates the need to wait until a certain number of untrusted nodes have verified a transaction before it can be confirmed.This reduced need for confirmation produces an increase in speed of transaction times. By intentionally placing trust with the most trustworthy of potential block signers, as decided by the network, no artificial encumbrance need be imposed to slow down the block signing process. DPOS allows for many more transactions to be included in a block than either proof of work or proof of stake systems. DPOS technology allows cryptocurrency technology to transact at a level where it can compete with the centralized clearinghouses like Visa and Mastercard. Such clearinghouses administer the most popular forms of electronic payment systems in the world.In a delegated proof of stake system centralization still occurs, but it is controlled. Unlike other methods of securing cryptocurrency networks, every client in a DPOS system has the ability to decide who is trusted rather than trust concentrating in the hands of those with the most resources. DPOS allows the network to reap some of the major advantages of centralization, while still maintaining some calculated measure of decentralization. This system is enforced by a fair election process where anyone could potentially become a delegated representative of the majority of users.",
       "assetType":"",
       "hashAlgorithm":"SHA-512",
       "proofType":"PoS",
       "totalCoinSupply":"2511953117",
       "whitepaper":"http://docs.bitshares.org/bitshares/papers/",
       "startDate":"05/11/2014",
       "website":"https://bitshares.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"2609330000.0",
       "twitter":{  
          "followers":13658,
          "link":"https://twitter.com/_bitshares"
       },
       "reddit":{  
          "subscribers":6722,
          "activeUsers":1867,
          "link":"https://www.reddit.com/r/BitShares/"
       },
       "facebook":{  
          "likes":11413,
          "link":"https://www.facebook.com/officialbitshares/"
       },
       "code":{  
          "stars":217,
          "language":"C++",
          "lastUpdate":"1518118370",
          "link":"https://github.com/bitshares/bitshares1-core"
       }
    },
    "QTUM":{  
       "ccId":"112392",
       "currency":"QTUM",
       "symbol":"QTUM",
       "description":"Qtum is a decentralized blockchain platform with dApp and turing-complete smart contract functionalities while still maintaining an Unspent Transaction Output (UTXO) transaction model. Qtum employs a Proof of Stake consensus mechanism. QTUM is the underlying value token in the Qtum blockchain.  Qtum’s goal is to work with industry partners, and launch the first Value Transfer Protocol (VTP). This will streamline daily business routines, and allow for easier adoption. Based on Bitcoin's UTXO model, the simple payment verification (SPV) Protocol is supported by default by the qtum codebase. As a result, you can now execute smart contracts from lite-wallets, which can be easily installed on any mobile device, declaring the age of mobile decentralized applications. Thanks to this, the blockchain is finally ready to present itself in a world in which half of all Internet traffic is generated by smartphones and tablets.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"POS 3.0",
       "proofType":"PoS",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://qtum.org/wp-content/uploads/2017/01/Qtum-technical-white-paper-draft-version.pdf",
       "startDate":"19/12/2016",
       "website":"https://qtum.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"73908692.0",
       "twitter":{  
          "followers":143455,
          "link":"https://twitter.com/QtumOfficial"
       },
       "reddit":{  
          "subscribers":12831,
          "activeUsers":2392,
          "link":"https://www.reddit.com/r/Qtum/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":752,
          "language":"C++",
          "lastUpdate":"1519580314",
          "link":"https://github.com/qtumproject/qtum"
       }
    },
    "ENG":{  
       "ccId":"338335",
       "currency":"Enigma",
       "symbol":"ENG",
       "description":"Enigma is a decentralized data marketplace, that guarantees the privacy of their users' shared data cryptographically. Enigma’s computational model is based on an optimized version of secure multi-party computation, backed by a verifiable secret-sharing scheme. For storage, Enigma uses a modified distributed hashtable for holding secret-shared data. An external blockchain is utilized as the controller of the network. It manages access control, identities and serves as a tamper-proof log of events. Security deposits are required and fees are charged in order to incentivize operation, correctness and fairness in the system. ENG is an Ethereum-based ERC 20 token that serves as currency on Enigma's network.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"150000000",
       "whitepaper":"https://enigma.co/enigma_full.pdf",
       "startDate":"28/07/2017",
       "website":"https://enigma.co/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"74836171.0",
       "twitter":{  
          "followers":51832,
          "link":"https://twitter.com/EnigmaMPC"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/enigmacatalyst//"
       },
       "facebook":{  
          "likes":2135,
          "link":"https://www.facebook.com/enigmacatalyst/"
       },
       "code":{  
 
       }
    },
    "NEBL":{  
       "ccId":"222085",
       "currency":"Neblio",
       "symbol":"NEBL",
       "description":"The Neblio Platform wants to provide fully open source APIs, tools, and services needed by business and enterprises to rapidly develop and deploy distributed applications. Replacing legacy database applications with truly scalable and reliable distributed applications through the development of familiar and easy to use API abstraction layers is the goal of the Neblio Platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"N/A",
       "whitepaper":"https://nebl.io/wp-content/uploads/2017/07/NeblioWhitepaper.pdf",
       "startDate":"06/08/2017",
       "website":"https://nebl.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"12851368.0",
       "twitter":{  
          "followers":68274,
          "link":"https://twitter.com/NeblioTeam"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/Neblio//"
       },
       "facebook":{  
          "likes":46393,
          "link":"https://www.facebook.com/neblioteam/"
       },
       "code":{  
 
       }
    },
    "LEND":{  
       "ccId":"418778",
       "currency":"EthLend",
       "symbol":"LEND",
       "description":"EthLend is decentralized lending application based on the Ethereum blockchain. LEND is an ERC20 token and its main utility is to be used for deployment payment fees on ETHLend with a 25% discount when compared to ETH.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1299999942",
       "whitepaper":"https://github.com/ETHLend/Documentation/blob/master/ETHLendWhitePaper.md",
       "startDate":"15/08/2017",
       "website":"https://ethlend.io/en/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1299999941.7031682,
       "twitter":{  
          "followers":40628,
          "link":"https://twitter.com/ethlend1"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":24884,
          "link":"https://www.facebook.com/ETHLend/"
       },
       "code":{  
 
       }
    },
    "SUB":{  
       "ccId":"221463",
       "currency":"Substratum Network",
       "symbol":"SUB",
       "description":"Substratum is developing an open-source foundation for the decentralized web, providing free and unrestricted access to content for a new Web 3.0.The Substratum Network is a worldwide collection of nodes that uses industry-leading cryptography to deliver secure content anywhere, all without the need for VPNs or Tor. Substratum wants to revolutionize the hosting industry with per-request billing via micro transactions, all handled by blockchain technology and artificial intelligence.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"600000000",
       "whitepaper":"http://substratum.net/wp-content/uploads/2017/08/substratum_whitepaper.pdf",
       "startDate":"14/08/2017",
       "website":"https://substratum.net/",
       "netHashesPerSecond":0,
       "totalCoinsMined":592000000,
       "twitter":{  
          "followers":56395,
          "link":"https://twitter.com/SubstratumNet"
       },
       "reddit":{  
          "subscribers":12373,
          "activeUsers":2313,
          "link":"https://www.reddit.com/r/SubstratumNetwork/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "ZRX":{  
       "ccId":"186277",
       "currency":"0x",
       "symbol":"ZRX",
       "description":"0x is an open protocol that facilitates the decentralized exchange of Ethereum-based tokens and assets. Developers can use 0x to build their own custom exchange apps with a wide variety of user-facing applications i.e. 0x OTC, a decentralized application that facilitates trustless over-the-counter trading of Ethereum-based tokens. The 0x token (ZRX) is used by Makers and Takers to pay transaction fees to Relayers (entities that host and maintain public order books). ZRX tokens are also used for decentralized governance over 0x protocol’s update mechanism which allows its underlying smart contracts to be replaced and improved over time.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/0x-white-paper.pdf",
       "startDate":"15/08/2017",
       "website":"https://www.0xproject.com/#home",
       "netHashesPerSecond":0,
       "totalCoinsMined":"513643197.0",
       "twitter":{  
          "followers":99586,
          "link":"https://twitter.com/0xproject"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":980,
          "link":"https://www.facebook.com/0xProject/"
       },
       "code":{  
          "stars":280,
          "language":"TypeScript",
          "lastUpdate":"1519306689",
          "link":"https://github.com/0xProject/contracts"
       }
    },
    "ELF":{  
       "ccId":"571314",
       "currency":"aelf",
       "symbol":"ELF",
       "description":"aelf is a multi-chain parallel computing network. ELF is an Ethereum-based ERC20 token that serves as a currency on aelf&#39;s ecosystem. Token holders are also able to vote on decisions related to the project&#39;s development and governance.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://grid.hoopox.com/%C3%A6lf_whitepaper_v1.2.pdf",
       "startDate":"18/12/2017",
       "website":"http://aelf.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"250000000.0",
       "twitter":{  
          "followers":66224,
          "link":"https://twitter.com/aelfblockchain"
       },
       "reddit":{  
          "subscribers":0,
          "activeUsers":0,
          "link":"https://www.reddit.com/r/aelf_blockchain//"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "ZEC":{  
       "ccId":"24854",
       "currency":"ZCash",
       "symbol":"ZEC",
       "description":"ZCash is a privacy driven cryptocurrency. It uses the Equihash as an algorithm, which is an asymmetric memory-hard Proof of Work algorithm based on the generalized birthday problem. It relies on high RAM requirements to bottleneck the generation of proofs and making ASIC development unfeasible. ZCash uses  zero-knowledge Succinct Non-interactive Arguments of Knowledge (zk-SNARKs) to ensure that all information (sender, reciever, ammount) is encrypted, without the possibility of double-spending. The only information that is revealed regarding transactions is the time in which they take place.",
       "features":"zk-SNARKsThe BasicZcash is the first widespread application of zk-SNARKs, a novel form of zero-knowledge cryptography. The strong privacy guarantee of Zcash is derived from the fact that shielded transactions in Zcash can be fully encrypted on the blockchain, yet still be verified as valid under the network’s consensus rules by using zk-SNARK proofs.The acronym zk-SNARK stands for “Zero-Knowledge Succinct Non-Interactive Argument of Knowledge,” and refers to a proof construction where one can prove possession of certain information, e.g. a secret key, without revealing that information, and without any interaction between the prover and verifier.“Zero-knowledge” proofs allow one party (the prover) to prove to another (the verifier) that a statement is true, without revealing any information beyond the validity of the statement itself. For example, given the hash of a random number, the prover could convince the verifier that there indeed exists a number with this hash value, without revealing what it is. Application to ZCASHIn order to have zero-knowledge privacy in Zcash, the function determining the validity of a transaction according to the network’s consensus rules must return the answer of whether the transaction is valid or not, without revealing any of the information it performed the calculations on. This is done by encoding some of the network&#39;s consensus rules in zk-SNARKs. At a high level, zk-SNARKs work by first turning what you want to prove into an equivalent form about knowing a solution to some algebraic equations. In the following section, we give a brief overview of how the rules for determining a valid transaction get transformed into equations that can then be evaluated on a candidate solution without revealing any sensitive information to the parties verifying the equations.",
       "assetType":"",
       "hashAlgorithm":"Equihash",
       "proofType":"PoW",
       "totalCoinSupply":"21000000",
       "whitepaper":"http://zerocash-project.org/media/pdf/zerocash-extended-20140518.pdf",
       "startDate":"28/10/2016",
       "website":"https://z.cash/",
       "netHashesPerSecond":502658727,
       "totalCoinsMined":"3359819.0",
       "twitter":{  
          "followers":62990,
          "link":"https://twitter.com/zcashco"
       },
       "reddit":{  
          "subscribers":12081,
          "activeUsers":1874,
          "link":"https://www.reddit.com/r/zec/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":3515,
          "language":"C++",
          "lastUpdate":"1519576053",
          "link":"https://github.com/zcash/zcash"
       }
    },
    "DASH":{  
       "ccId":"3807",
       "currency":"DigitalCash",
       "symbol":"DASH",
       "description":"DigitalCash (DASH) uses a new chained hashing algorithm approach, with many new scientific hashing algorithms for the proof-of-work. DASH aims to be the first privacy-centric cryptographic currency with fully encrypted transactions and anonymous block transactions, this feature is called PrivateSend and can be found on the official Dashcore wallet.PrivateSend mixes your DASH coins with other users who are also using this feature at the time, making your transactions untraceable. Users can also earn DigitalCash rewards by hosting a master node to help maintain the Blockchain. One must have a balance of at least 1000 DASH in order to host a Dash master node, this collateral is required to avoid 51% attacks on the network.",
       "features":"Difficulty retargets each blockBlock reward decreases each block according to the formula: BaseReward = (MSupply - A)/218, where MSupply = (264 - 1) atomic units and &#39;A&#39; is amount of already generated coinsPOW mechanism is a voting system for users",
       "assetType":"",
       "hashAlgorithm":"X11",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"22000000",
       "whitepaper":"https://github.com/dashpay/dash/wiki/Whitepaper",
       "startDate":"18/01/2014",
       "website":"http://dash.org",
       "netHashesPerSecond":5779904280129368,
       "totalCoinsMined":"7906482.0",
       "twitter":{  
          "followers":281604,
          "link":"https://twitter.com/Dashpay"
       },
       "reddit":{  
          "subscribers":20063,
          "activeUsers":2199,
          "link":"https://www.reddit.com/r/dashpay/"
       },
       "facebook":{  
          "likes":35266,
          "link":"https://www.facebook.com/DashPay/"
       },
       "code":{  
          "stars":927,
          "language":"C++",
          "lastUpdate":"1519561090",
          "link":"https://github.com/dashpay/dash"
       }
    },
    "KNC":{  
       "ccId":"310497",
       "currency":"Kyber Network",
       "symbol":"KNC",
       "description":"KyberNetwork is an on-chain protocol which allows instant exchange and conversion of digital assets (e.g. crypto tokens) and cryptocurrencies (e.g. Ether, Bitcoin, ZCash) with high liquidity.KyberNetwork wants to implement several ideal operating properties of an exchange including trustless, decentralized execution, instant trade and high liquidity. Besides serving as an exchange, KyberNetwork also provides payment APIs that will allow Ethereum accounts to easily receive payments from any crypto tokens.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"226000000",
       "whitepaper":"https://home.kyber.network/assets/KyberNetworkWhitepaper.pdf",
       "startDate":"01/01/0001",
       "website":"https://kyber.network/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"134132697.0",
       "twitter":{  
          "followers":67075,
          "link":"https://twitter.com/KyberNetwork"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "ENJ":{  
       "ccId":"283116",
       "currency":"Enjin Coin",
       "symbol":"ENJ",
       "description":"Enjin is a decentralized platform that wants to manage, distribute, and trade virtual goods. Giving gamers and content creators a new model of virtual ownership. Enjin Coin platform is made for the game industry. SDKs for multiple languages, wallets and payment platforms will be available and completely open-source.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://enjincoin.io/enjincoin_whitepaper.pdf",
       "startDate":"24/07/2017",
       "website":"https://enjincoin.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":208,
          "link":"https://twitter.com/enjincs"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/EnjinCoin//"
       },
       "facebook":{  
          "likes":54841,
          "link":"https://www.facebook.com/enjinsocial/"
       },
       "code":{  
          "stars":12,
          "language":"null",
          "lastUpdate":"1507844426",
          "link":"https://github.com/enjin/smartcontracts"
       }
    },
    "ARN":{  
       "ccId":"335127",
       "currency":"Aeron",
       "symbol":"ARN",
       "description":"The solution that Aeron proposes, relies on blockchain technology to track aircraft maintenance and pilot logs. Aeron is constructing a database and an online system that is decentralized and hosts global data on aircraft, flight schools and pilots. This electronic logging system would enable pilots to have logs that can be verified online, making aviation safer for everyone involved.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"",
       "startDate":"10/08/2017",
       "website":"https://aeron.aero/",
       "netHashesPerSecond":0,
       "totalCoinsMined":20000000,
       "twitter":{  
          "followers":13152,
          "link":"https://twitter.com/aeron_aero"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":2909,
          "link":"https://www.facebook.com/aeronpublic/"
       },
       "code":{  
 
       }
    },
    "RPX":{  
       "ccId":"341267",
       "currency":"Red Pulse",
       "symbol":"RPX",
       "description":"Red Pulse is a NEO-based market intelligence platform covering China's financial and capital markets. RPX is the token that serves as currency on Red Pulse's framework. The supply of RPX will increase over time at a rate of 10% per year.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1358371250",
       "whitepaper":"https://coin.red-pulse.com/wp-content/uploads/redpulse-whitepaper-en.pdf",
       "startDate":"08/10/2017",
       "website":"https://www.red-pulse.com",
       "netHashesPerSecond":0,
       "totalCoinsMined":543348500,
       "twitter":{  
          "followers":29491,
          "link":"https://twitter.com/red_pulse_china"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":1472,
          "link":"https://www.facebook.com/redpulsechina/"
       },
       "code":{  
 
       }
    },
    "FUEL":{  
       "ccId":"292748",
       "currency":"Etherparty",
       "symbol":"FUEL",
       "description":"Etherparty is a user-friendly system for the creation, use, and management of smart contracts, that may dramatically expand the rate of commercial and consumer adoption of blockchain technology. While blockchain has the potential to recast the foundations of electronic commerce and data storage, the technology’s use by non-computer professionals has been limited by a lack of user-friendly applications.Etherparty unleashes the speed, cost-reduction and security benefits of smart contracts for individuals and businesses. Etherparty goes further to make otherwise complicated contractual agreements and processes simple and accessible while enabling infrastructure for authentication and automation.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://etherparty.com/Etherparty_White_Paper_EN.pdf",
       "startDate":"01/10/2017",
       "website":"http://etherparty.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":2,
          "link":"https://twitter.com/etherparty_io"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":2238,
          "link":"https://www.facebook.com/etherparty/"
       },
       "code":{  
 
       }
    },
    "MDA":{  
       "ccId":"341279",
       "currency":"Moeda",
       "symbol":"MDA",
       "description":"MOEDA is a Cooperative Crypto Credit Banking-as-a-Service Platform designed to provide a mobile lending system. Moeda will provide a multi-purpose digital identity and opportunities to build credit-worthiness and reputation. It will also give investors real-time transparency of SDG-aligned Impact Investment, trust of cryptographically assured blockchain records and contracts while facilitating the scaling of community investments, payment transactions and service more customers online.Moeda Tokens (MDA) are backed by a social contract in loyal support of Green Cross Brazil to achieve the United Nations Sustainable Development Goals (SDGs). The tokens will be transferable once the sale has concluded.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"19628888",
       "whitepaper":"https://moeda.in/whitepaper.pdf",
       "startDate":"17/07/2017",
       "website":"https://moeda.in/",
       "netHashesPerSecond":0,
       "totalCoinsMined":19628888,
       "twitter":{  
          "followers":7091,
          "link":"https://twitter.com/moedabanking"
       },
       "reddit":{  
          "subscribers":247,
          "activeUsers":40,
          "link":"https://www.reddit.com/r/MoedaBanking/"
       },
       "facebook":{  
          "likes":71237,
          "link":"https://www.facebook.com/moedabanking/"
       },
       "code":{  
          "stars":8,
          "language":"JavaScript",
          "lastUpdate":"1516932341",
          "link":"https://github.com/moedabank/moeda"
       }
    },
    "AE":{  
       "ccId":"190978",
       "currency":"Aeternity",
       "symbol":"AE",
       "description":"Aeternity is a scalable blockchain platform that enables high bandwidth transacting, purely-functional smart contracts, and decentralized oracles.The use of the blockchain is not free, and requires that the user spends a token called Aeon. Aeon&#39;s are used as payment for any resources one consumes on the platform, as well as the basis for financial applications implemented on the platform. All system fees get paid with aeon, all smart contracts settle in aeon.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"273685831",
       "whitepaper":"https://aeternity.com/aeternity-blockchain-whitepaper.pdf",
       "startDate":"29/12/2016",
       "website":"https://www.aeternity.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"233020472.0",
       "twitter":{  
          "followers":15005,
          "link":"https://twitter.com/aetrnty"
       },
       "reddit":{  
          "subscribers":2173,
          "activeUsers":2445,
          "link":"https://www.reddit.com/r/Aeternity/"
       },
       "facebook":{  
          "likes":1875,
          "link":"https://www.facebook.com/aeternityproject/"
       },
       "code":{  
 
       }
    },
    "RCN":{  
       "ccId":"307219",
       "currency":"Ripio",
       "symbol":"RCN",
       "description":"RCN is a global credit network based on cosigned smart contracts that connects lenders and borrowers located anywhere in the world and on any currency. The smart contracts connect agents with information on the borrower’s identity to agents that analyze the borrower’s credit risk impartially, thus standardizing credit lending through blockchain technology. A cosigner acts as a re insurer that distributes and reduces the lender’s risk and, at the same time, helps to improve the contract conditions by retaining access to the borrower’s local legal system.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoW",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://ripiocredit.network/wp/RCN%20Whitepaper%20ENG.pdf",
       "startDate":"17/10/2017",
       "website":"https://ripiocredit.network/",
       "netHashesPerSecond":0,
       "totalCoinsMined":999942647.35309,
       "twitter":{  
          "followers":18982,
          "link":"https://twitter.com/RCN_token"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r//RCN_token//"
       },
       "facebook":{  
          "likes":14697,
          "link":"https://www.facebook.com/ripiocredit.network/"
       },
       "code":{  
          "stars":16,
          "language":"JavaScript",
          "lastUpdate":"1516725094",
          "link":"https://github.com/ripio/rcn-token"
       }
    },
    "MANA":{  
       "ccId":"199148",
       "currency":"Decentraland",
       "symbol":"MANA",
       "description":"",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"2805886393.1583",
       "whitepaper":"https://decentraland.org/whitepaper.pdf",
       "startDate":"08/08/2017",
       "website":"https://decentraland.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":2644403343.158303,
       "twitter":{  
          "followers":29315,
          "link":"https://twitter.com/decentraland"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":5346,
          "link":"https://www.facebook.com/decentraland/"
       },
       "code":{  
          "stars":56,
          "language":"JavaScript",
          "lastUpdate":"1519098139",
          "link":"https://github.com/decentraland/mana"
       }
    },
    "CDT":{  
       "ccId":"177139",
       "currency":"CoinDash",
       "symbol":"CDT",
       "description":"Coindash​ is an operating system for blockchain-based assets, it has the goal of making handling and trading easy and accessible for both new and experienced users in the cryptoshpere. The CoinDash’s ecosystem includes three synergistic components: Software-as-a-Service (Saas), Social Networking and the Marketplace.SaaS: CoinDash provides analytics that give users deep insight into the performance of their investments and help them make data driven decisions.Social Network: CoinDash provides social trading features that remove barriers for new and existing crypto users by letting them follow and copy-trade top investors.Marketplace: CoinDash’s marketplace is built around opportunity discovery and streamlined trading UX with features like real-time social trading signals, an ICO dashboard, trending assets, real-time market price tables and 3rd party integration. ​Every action within the CoinDash platform requires the user to pay a fee which is paid in the CoinDash (CDT), an Ethereum-based token Every user who facilitates the use of a feature which in turn gives financial value will be entitled to a payment, creating a creator-consumer relationship between users in the system.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/coindash-whitepaper.pdf",
       "startDate":"28/03/2017",
       "website":"https://www.coindash.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":19127,
          "link":"https://twitter.com/coindashio"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":4671,
          "link":"https://www.facebook.com/coindash.io/"
       },
       "code":{  
 
       }
    },
    "WAVES":{  
       "ccId":"20131",
       "currency":"Waves",
       "symbol":"WAVES",
       "description":"Waves is a custom blockchain tokens platform designed for large-scale business and consumer adoption. Waves was created to make the benefits of blockchain technology accessible to ordinary businesses and end users. The platform launched in 2016 and was designed from the ground up to address the shortcomings of existing blockchain services. The result is an enterprise-ready platform that emphasises security, easy token operations (creation, transfer, exchange) and a straightforward user experience, as well as dealing with critical long-term issues such as speed and scalability.",
       "features":"Waves is the first production system being built on top of the Scorex frameworkExtensible solution: In order to fix the need for a mandatory hard fork when creating a new type of transaction on the NXT Platform (forcing network client software updates) WAVES offers plug-ins that are not included in the core software module, but are instead installed as an extension on top of it. ",
       "assetType":"",
       "hashAlgorithm":"Leased POS",
       "proofType":"LPoS",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://blog.wavesplatform.com/waves-whitepaper-164dd6ca6a23?gi=6b67556d598f",
       "startDate":"12/06/2016",
       "website":"https://wavesplatform.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"100000000.0",
       "twitter":{  
          "followers":108292,
          "link":"https://twitter.com/wavesplatform"
       },
       "reddit":{  
          "subscribers":8221,
          "activeUsers":2088,
          "link":"https://www.reddit.com/r/Wavesplatform/"
       },
       "facebook":{  
          "likes":63632,
          "link":"https://www.facebook.com/wavesplatform/"
       },
       "code":{  
          "stars":481,
          "language":"Scala",
          "lastUpdate":"1519514286",
          "link":"https://github.com/wavesplatform/Waves"
       }
    },
    "QSP":{  
       "ccId":"397757",
       "currency":"Quantstamp",
       "symbol":"QSP",
       "description":"The Quantstamp is a protocol that aims to create a scalable and cost-effective audit system to all smart contracts on the Ethereum network.The protocol will use the SAT solver software to verify the programs solidity. In order to have the necessary computing power for the software, the Quantstamp will leverage a distributed network of participants.Quantstamp token (QSP) is an ERC-20 token that will benefit the users in several ways. QSP will reward those who contribute to the software for verifying the solidity programs, who run the Quantstamp validation node (a specialized node on the Ethereum network), and those who find bugs on the smart contracts.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"976442388.3211",
       "whitepaper":"https://crushcrypto.com/wp-content/uploads/2017/10/QSP-Whitepaper.pdf",
       "startDate":"01/10/2017",
       "website":"https://quantstamp.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"617314171.0",
       "twitter":{  
          "followers":46810,
          "link":"https://twitter.com/Quantstamp"
       },
       "reddit":{  
          "subscribers":7971,
          "activeUsers":2358,
          "link":"https://www.reddit.com/r/Quantstamp/"
       },
       "facebook":{  
          "likes":42488,
          "link":"https://www.facebook.com/quantstamp/"
       },
       "code":{  
 
       }
    },
    "SALT":{  
       "ccId":"314580",
       "currency":"Salt Lending",
       "symbol":"SALT",
       "description":"SALT is a membership based lending and borrowing network that allows users to leverage their blockchain assets to secure cash loans. The SALT Secured Automated Lending Technology is a protocol and asset agnostic architecture designed to adapt to the constantly growing class of blockchain assets.The SALT Platform is automated and cryptographically secure. SALT is a lending platform specifically designed for blockchain assets; operating as a second layer protocol which sits atop any public or permissioned blockchain, allowing the underlying asset to be used as collateral for access to credit.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"120000000",
       "whitepaper":"https://membership.saltlending.com/files/abstract.pdf",
       "startDate":"28/07/2017",
       "website":"https://www.saltlending.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"54243413.0",
       "twitter":{  
          "followers":40683,
          "link":"https://twitter.com/SaltLending"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":11717,
          "link":"https://www.facebook.com/SALTLENDING/"
       },
       "code":{  
 
       }
    },
    "FUN":{  
       "ccId":"178978",
       "currency":"FunFair",
       "symbol":"FUN",
       "description":"FunFair is an Ethereum-based casino that allows users to bet in a trustless and decentralized model, featuing 3D games can be built in HTML5. FunFair offers cheap fees in terms of gas costs. The FUN coin is also an Ethereum-based token that will be used for all platform actions, including betting, lending, paying out players and compensating stakeholders.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"17173696076",
       "whitepaper":"https://funfair.io/how-it-works/whitepapers/",
       "startDate":"15/06/2017",
       "website":"https://funfair.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"4503688789.0",
       "twitter":{  
          "followers":33679,
          "link":"https://twitter.com/FunFairTech"
       },
       "reddit":{  
          "subscribers":17485,
          "activeUsers":2422,
          "link":"https://www.reddit.com/r/FunfairTech/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "BTG":{  
       "ccId":"347235",
       "currency":"Bitcoin Gold",
       "symbol":"BTG",
       "description":"Bitcoin Gold is a distributed digital currency. It is a hard fork of Bitcoin, the open source cryptocurrency. The stated purpose of the hard fork is to restore the mining functionality with common Graphics Processing Units (GPU), in place of mining with specialized ASIC (customized chipsets), used to mine Bitcoin.  A central part of the bitcoin process, mining, is being controlled by a few manufacturers who sell their products to a select group of industrialized miners, centralizing the mining task and breaking with one of the core values of bitcoin - decentralization. ASIC resistant GPU powered mining provides a solution, as this kind of hardware is ubiquitous, and anyone can start mining with a standard, off-the-shelf laptop computer.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Equihash",
       "proofType":"PoW",
       "totalCoinSupply":"21000000",
       "whitepaper":"",
       "startDate":"25/10/2017",
       "website":"https://bitcoingold.org/",
       "netHashesPerSecond":54647858.31485181,
       "totalCoinsMined":"16847086.0",
       "twitter":{  
          "followers":66040,
          "link":"https://twitter.com/bitcoingold"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":20188,
          "link":"https://www.facebook.com/bitcoingoldofficial/"
       },
       "code":{  
          "stars":505,
          "language":"C++",
          "lastUpdate":"1519566189",
          "link":"https://github.com/BTCGPU/BTCGPU"
       }
    },
    "BCD":{  
       "ccId":"409492",
       "currency":"Bitcoin Diamond",
       "symbol":"BCD",
       "description":"Bitcoin Diamond (BCD) is a fork of Bitcoin that will occur at the predetermined height of block 495866. It is a PoW/PoS cryptocurrency based on X13 algorithm.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"X13",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"210000000",
       "whitepaper":"",
       "startDate":"01/01/0001",
       "website":"http://btcd.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":154786875,
       "twitter":{  
          "followers":25779,
          "link":"https://twitter.com/BitcoinDiamond_"
       },
       "reddit":{  
          "subscribers":0,
          "activeUsers":0,
          "link":"https://www.reddit.com/r/Bitcoin-Diamond//"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":5,
          "language":"C++",
          "lastUpdate":"1518214894",
          "link":"https://github.com/Bitcoin-Diamond/BitcoinDiamond"
       }
    },
    "AMB":{  
       "ccId":"238733",
       "currency":"Ambrosus",
       "symbol":"AMB",
       "description":"The Ambrosus project aims to improve the global food supply chains by creating an ecosystem where the team can record the entire history of products and execute commercial transactions accordingly.Combining high-tech sensors, blockchain protocol and smart contracts, Ambrosus is building a community-driven ecosystem to assure the quality, safety &amp; origins of products.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"361477438",
       "whitepaper":"https://ambrosus.com/assets/Ambrosus-White-Paper-V8-1.pdf",
       "startDate":"19/07/2017",
       "website":"https://ambrosus.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":361477437.53570145,
       "twitter":{  
          "followers":13520,
          "link":"https://twitter.com/AmbrosusAMB"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/ambrosus//"
       },
       "facebook":{  
          "likes":3873,
          "link":"https://www.facebook.com/ambrosusAMB/"
       },
       "code":{  
 
       }
    },
    "AST":{  
       "ccId":"337162",
       "currency":"AirSwap",
       "symbol":"AST",
       "description":"The Swap protocol provides a peer-to-peer methodology to exchange assets on the Ethereum blockchain.AirSwap is an ERC20 token that will have two functionalities, signal the intention to buy or sell Ethereum-based tokens and to give voting power to the traders providing managing capabilities to the roles of Oracles within the platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"500000000",
       "whitepaper":"https://swap.tech/whitepaper/",
       "startDate":"26/09/2017",
       "website":"https://www.airswap.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":500000000,
       "twitter":{  
          "followers":24218,
          "link":"https://twitter.com/airswap"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":2843,
          "link":"https://www.facebook.com/airswapio/"
       },
       "code":{  
 
       }
    },
    "WABI":{  
       "ccId":"340940",
       "currency":"WaBi",
       "symbol":"WABI",
       "description":"WaBi is an Ethereum-based platform supporting Walimai&#39;s anti-counterfeit system. The Walimai anti-counterfeit labels link digital and physical assets through RFID Radio-frequency identification with anti-copy functionality. Consumers can authenticate the product through their phone app and are able to purchase products protected by Walimai technology with WABI. User are also rewarded with WABI tokens for for using the Walimai safe channel. WABI is an Ethereum-based ERC 20 token used in the Walimai safe channel. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://resources.wacoin.io/WaBI_Whitepaper_ENG.pdf",
       "startDate":"21/07/2017",
       "website":"http://www.wacoin.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":100000000,
       "twitter":{  
          "followers":30852,
          "link":"https://twitter.com/wabiico"
       },
       "reddit":{  
          "subscribers":8117,
          "activeUsers":61,
          "link":"https://www.reddit.com/r/WabiToken/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "XZC":{  
       "ccId":"30022",
       "currency":"ZCoin",
       "symbol":"XZC",
       "description":"ZCoin is a Proof of Work cryptocurrency using the Lyra2 hashing algorithm. It is an implementation of the Zerocoin protocol (http://zerocoin.org) guaranteeing true financial anonymity using ZK-Snarks. Zero-Knowledge proofs allows one to show ownership of a Zcoin coin without having to reveal which coin one owns.Recently, the Zcoin protocol was found to have a typographic bug that costed the network roughly $400k. This bug, however, did not compromise the anonimity features of Zcoin.Click here for Masternode stats from masternodes.online.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Lyra2RE",
       "proofType":"PoW",
       "totalCoinSupply":"21000000",
       "whitepaper":"",
       "startDate":"01/01/0001",
       "website":"https://zcoin.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":"4185917.0",
       "twitter":{  
          "followers":45814,
          "link":"https://twitter.com/zcoinofficial"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":254,
          "language":"C++",
          "lastUpdate":"1519049298",
          "link":"https://github.com/zcoinofficial/zcoin"
       }
    },
    "BQX":{  
       "ccId":"141464",
       "currency":"Ethos",
       "symbol":"BQX",
       "description":"Ethos created a platform that could provides a single point of interaction with the new economy. This Digital Wallet is the backbone for Ethos' asset management and cryptocurrency services platform. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"222295208.2384",
       "whitepaper":"",
       "startDate":"28/06/2017",
       "website":"https://www.ethos.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":222295208.23845324,
       "twitter":{  
          "followers":48204,
          "link":"https://twitter.com/Ethos_io"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/ethos_io//"
       },
       "facebook":{  
          "likes":8500,
          "link":"https://www.facebook.com/ethosplatform/"
       },
       "code":{  
 
       }
    },
    "SNGLS":{  
       "ccId":"24926",
       "currency":"SingularDTV",
       "symbol":"SNGLS",
       "description":"SingularDTV (S-DTV) is a decentralized and tokenized content creating and distributing platform that will create, acquire and distribute film and television content in an innovative way, generating revenue for its token holders in a completely transparent and decentralized manner.SNGLS are tokens built on Ethereum and represent a share in the SingularDTV platform, which is comprised of four key elements:‘SINGULAR’ – a mini Sci-fi television series about decentralization and technological advancements in a futuristic setting, comprised of 3 episode seasons.The S-DTV DOCUMENTARY DIVISION - A Documentary Division that will focus on producing documentary films about blockchain technology.THE S-DTV RIGHTS MANAGEMENT PLATFORM - A digital rights, revenue and royalty management platform for all the content produced and acquired by SingularDTV.THE S-DTV TRANSACTION VIDEO-ON-DEMAND (TVOD) PORTAL - A TVOD Portal to distribute SingularDTV content via GooglePlay, AppleTV iTunes, and Vimeo. SNGLS tokens will also generate dividends for its holders, depending on the revenue gathered by the SingularDTV platform. 1 Billion SNGLS tokens will be issued, which will be distributed in the following way:500M SNGLS will be distributed to investors in an initial coin offering period. Each token will cost the ETH equivalent of $0.015.400M SNGLS will be kept in a vault, and the dividends generated by the tokens will be used to further develop the S-DTV ecosystem.100M SNGLS will be given to S-DTV&#39;s core investors.The Vault where 400M tokens are kept will be managed by the Workshop. The Workshop will not only spend and convert ETH to build new projects or to work on existing ones, but it will also collect cryptocurrency and fiat revenue to deposit back in the safe. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000 ",
       "whitepaper":"https://coss.io/documents/white-papers/singulardtv.pdf",
       "startDate":"02/10/2016",
       "website":"https://singulardtv.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":22492,
          "link":"https://twitter.com/SingularDTV"
       },
       "reddit":{  
          "subscribers":2041,
          "activeUsers":89,
          "link":"https://www.reddit.com/r/SingularDTV/"
       },
       "facebook":{  
          "likes":18880,
          "link":"https://www.facebook.com/SingularDTV/"
       },
       "code":{  
          "stars":22,
          "language":"Python",
          "lastUpdate":"1518918203",
          "link":"https://github.com/ConsenSys/singulardtv-contracts"
       }
    },
    "LRC":{  
       "ccId":"318169",
       "currency":"Loopring",
       "symbol":"LRC",
       "description":"Loopring is an open, multilateral token exchange protocol for decentralized exchange on the Ethereum blockchain. Loopring is intended to serve as a common building block with open standards, driving interoperability among decentralized applications (DAPPs) that incorporate exchange functionality. Trades are executed by a system of Ethereum smart contracts that are publicly accessible, free to use, and that any dApp can hook into. Loopring’s token is based on the ERC20 Ethereum Token Standard and can be liquidated through a Loopring smart contract.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1395076055",
       "whitepaper":"https://github.com/Loopring/whitepaper/blob/master/en_whitepaper.pdf",
       "startDate":"06/08/2017",
       "website":"https://loopring.org",
       "netHashesPerSecond":0,
       "totalCoinsMined":"561207157.0",
       "twitter":{  
          "followers":23030,
          "link":"https://twitter.com/loopringorg"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":140,
          "language":"TypeScript",
          "lastUpdate":"1519499044",
          "link":"https://github.com/Loopring/protocol"
       }
    },
    "POWR":{  
       "ccId":"339617",
       "currency":"Power Ledger",
       "symbol":"POWR",
       "description":"Power Ledger is a decentralized energy exchange platform. It incorporates energy applications, such as a P2P energy trading application that allows businesses to host trading on the platform. This technology enables the sale of surplus renewable energy generated at residential and commercial developments (including multi-unit/multi-tenanted) connected to existing electricity distribution networks, or within micro-grids. POWR is an Ethereum-based token that fuels the Power Ledger Ecosystem. POWR tokens serve as access permisson tokens, allowing the Application Hosts and their consumers to gain access to the P2P trading features and other Power Ledger applications. To synchronize the ecosystem globally and create cross-market electricity compatibility, a second token, Sparkz, is used in Power Ledger&#39;s ecosystem transactions. Applications Hosts may convert their POWR tokens to Sparks when the ecosystem has been accessed.    ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://powerledger.io/media/Power-Ledger-Whitepaper-v8.pdf",
       "startDate":"05/07/2017",
       "website":"https://powerledger.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":"363932644.0",
       "twitter":{  
          "followers":77781,
          "link":"https://twitter.com/PowerLedger_io"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":19655,
          "link":"https://www.facebook.com/powerledger/"
       },
       "code":{  
 
       }
    },
    "SNT":{  
       "ccId":"137013",
       "currency":"Status Network Token",
       "symbol":"SNT",
       "description":"Status is an open source messaging platform and mobile browser that allows users to interact with decentralized applications (dApps) that run on the Ethereum Network. In Status, users own and control their own data, wealth and digital identity. The Status Network Token (&#39;SNT&#39;) is an Ethereum-based token that is required to interact with the Status Network.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"6804870175",
       "whitepaper":"https://status.im/whitepaper.pdf",
       "startDate":"20/06/2017",
       "website":"https://status.im/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"3470483788.0",
       "twitter":{  
          "followers":87371,
          "link":"https://twitter.com/ethstatus"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":9508,
          "link":"https://www.facebook.com/ethstatus/"
       },
       "code":{  
          "stars":332,
          "language":"Go",
          "lastUpdate":"1519540307",
          "link":"https://github.com/status-im/status-go"
       }
    },
    "NULS":{  
       "ccId":"377792",
       "currency":"Nuls",
       "symbol":"NULS",
       "description":"Nuls is an open-source platform that will provide to the network members development tools for their projects. The Nuls&#39; team main goal is to create a community-driven development based on the consensus mechanism proof-of-credit and modular architecture.Nuls token in an ERC-20 token that will be used to support Nuls-based applications, pay for application cost, exchange for assets, support Nuls development, and pay transaction fees just to name a few.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"40000000",
       "whitepaper":"https://nuls.io/pdf/NulsWhitepaper1.1.pdf",
       "startDate":"01/09/2017",
       "website":"https://nuls.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":40000000,
       "twitter":{  
          "followers":14267,
          "link":"https://twitter.com/nulsservice"
       },
       "reddit":{  
          "subscribers":2822,
          "activeUsers":64,
          "link":"https://www.reddit.com/r/nulsservice/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":151,
          "language":"Java",
          "lastUpdate":"1519390012",
          "link":"https://github.com/nuls-io/nuls"
       }
    },
    "OST":{  
       "ccId":"369132",
       "currency":"Simple Token",
       "symbol":"OST",
       "description":"Simple Token enables any business to launch a branded cryptocurrency on open Ethereum sidechains. Simple Token, a protocol for consumer app tokenization is bringing crypto to mainstream apps, enabling them to launch branded crypto tokens without the ICO drama.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"800000000",
       "whitepaper":"https://ost.com/documents",
       "startDate":"13/10/2017",
       "website":"https://simpletoken.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":800000000,
       "twitter":{  
          "followers":22488,
          "link":"https://twitter.com/TheSimpleToken"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":9617,
          "link":"https://www.facebook.com/simpletoken/"
       },
       "code":{  
 
       }
    },
    "EVX":{  
       "ccId":"194883",
       "currency":"Everex",
       "symbol":"EVX",
       "description":"Everex is a blockchain-based capital transfer system that aims to enable and ease the financial inclusion of unbanked, or underbanked people around the world.Everex proposes the Cryptocash, a cryptocurrency, where each unit has its value pegged to, and a name based on, the fiat currency it represents. Users convert local fiat currencies to Cryptocash using a currency exchange and transfer the coins to their Everex wallet.Cryptocash balances are provably underwritten by actual balances held in accounts of licensed financial institutions. The Everex system provides its users access to financial services using Cryptocash, without the volatility issues of existing, non-stablecoin cryptocurrencies.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"25000000",
       "whitepaper":"https://daks2k3a4ib2z.cloudfront.net/59157962bdb4300afa8771a9/595c495244be4234f13093ce_EverexWP-Version-v0.31.pdf",
       "startDate":"24/07/2017",
       "website":"https://www.everex.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":25000000,
       "twitter":{  
          "followers":13042,
          "link":"https://twitter.com/everexio"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":6831,
          "link":"https://www.facebook.com/everex.io/"
       },
       "code":{  
 
       }
    },
    "NAV":{  
       "ccId":"4571",
       "currency":"NavCoin",
       "symbol":"NAV",
       "description":"NavCoin (NAV) is a privacy-driven PoW/PoS hybrid cryptocurrency. NAV uses the x13 hashing algorithm. NavCoin&#39;s encryption software disconnects and randomises the transaction data, removing it even from an IP address. NavCoin uses a subchain to process anonymous transactions.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"X13",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"0",
       "whitepaper":"",
       "startDate":"06/06/2014",
       "website":"https://navcoin.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":62449256.16633359,
       "twitter":{  
          "followers":47794,
          "link":"https://twitter.com/NavCoin"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":5369,
          "link":"https://www.facebook.com/NavCoin/"
       },
       "code":{  
          "stars":5,
          "language":"C++",
          "lastUpdate":"1515858187",
          "link":"https://github.com/navcoindev/navcoin2"
       }
    },
    "TNB":{  
       "ccId":"517483",
       "currency":"Time New Bank",
       "symbol":"TNB",
       "description":"Time New Bank is a token backed by the Miao&#39;A International Timechain (M.I.T). The M.I.T will use the Ethereum blockchain to build a precision time-value-based transmission network, as the whitepaper reads:\"We highly acknowledge the time-value of money for each individual, and that the extent of which an individual's time is valued depends on how much he/she is needed by others, i.e. the more helpful an individual is, the higher the individual is needed...M.I.T will introduce TNB (Time New Bank) digital currency aiming to establish a time-value transmission network\"The TNB is an ERC-20 token that will work as the medium of exchange between time exporters and time demanders.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"5541877892.218590616799998",
       "whitepaper":"https://tnb.fund/pdf/TNB_business_white_paper_en.pdf?v=1.0.1",
       "startDate":"01/10/2016",
       "website":"https://tnb.fund",
       "netHashesPerSecond":0,
       "totalCoinsMined":5541877892.218591,
       "twitter":{  
          "followers":12379,
          "link":"https://twitter.com/TimeNewBank"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":8,
          "language":"JavaScript",
          "lastUpdate":"1519292912",
          "link":"https://github.com/fanxiong/crowdsale-contracts"
       }
    },
    "TNT":{  
       "ccId":"186309",
       "currency":"Tierion",
       "symbol":"TNT",
       "description":"Tierion is a platform for data verification. Tierion works by creating a proof that links data to a transaction on a blockchain. This is called anchoring. Anyone with this proof can verify the data’s integrity and timestamp without relying on a trusted authority.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://tokensale.tierion.com/TierionTokenSaleWhitePaper.pdf",
       "startDate":"17/07/2017",
       "website":"https://tierion.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":15895,
          "link":"https://twitter.com/tierion"
       },
       "reddit":{  
          "subscribers":2449,
          "activeUsers":62,
          "link":"https://www.reddit.com/r/tierion/"
       },
       "facebook":{  
          "likes":810,
          "link":"https://www.facebook.com/TierionInc/"
       },
       "code":{  
 
       }
    },
    "MOD":{  
       "ccId":"345510",
       "currency":"Modum",
       "symbol":"MOD",
       "description":"Modum is a platform that will use the Ethereum blockchain to provide a supply chain for the pharmacy industry assuring a high level of data integrity, security, independent verification and, flexible data ownership, just to name a few characteristics. In order to achieve this, Modum solutions enables companies to prove compliance with GDP regulations using blockchain and Internet-of-Things (IoT) technology.The Modum token will give to users voting rights. The token holders could vote to decide either if the pre-defined milestones of the project were achieved or not. Furthermore, users will benefit as Modum shareholders.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"18266200",
       "whitepaper":"https://modum.io/whitepaper/",
       "startDate":"15/08/2017",
       "website":"https://modum.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":18266200,
       "twitter":{  
          "followers":12461,
          "link":"https://twitter.com/modum_io"
       },
       "reddit":{  
          "link":"https://www.reddit.com/r/modum_io//"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "OAX":{  
       "ccId":"180013",
       "currency":"OpenANX",
       "symbol":"OAX",
       "description":"OAX is a token that can be exchanged for memberships in the DAO and/or its association. Members will be entitled to certain privileges, including but not limited to voting privileges on major operational decisions relating to the openANX platform. The memberships will work through a tiered structure that allow for simple access, voting privileges or commercial (read: business) solicitation of services on the platform (e.g. escrow, legal, exchange, credit, asset gateway) with the relative number of tokens required for redemption varying with the level of benefits.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"https: //www.oax.org/en/assets/whitepaper",
       "startDate":"01/06/2017",
       "website":"https://www.openanx.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":100000000,
       "twitter":{  
          "followers":10525,
          "link":"https://twitter.com/OAX_Foundation"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "MCO":{  
       "ccId":"166548",
       "currency":"Monaco",
       "symbol":"MCO",
       "description":"The functionality of Monaco VISA® Card makes it a must-have item not only for every Ether or Bitcoin holder, but also for everyone who spends money in foreign currency. Core features: - Spend your Ether or Bitcoin with a physical Monaco VISA® Card, wherever VISA® cards are accepted, both online &amp; offline - Only the exact amount that you spend with your Monaco VISA® Card will be incrementally exchanged from ETH/BTC in real-time when you swipe your card, with rest being securely stored in your wallet to which only you have access - Exchange money at perfect interbank exchange rates using Monaco App - Enjoy the same perfect interbank rates whenever you spend on Monaco VISA® Card  - Sending money between Monaco App users is free &amp; real-time, with the money being instantly available for the recipient on their Monaco VISA® Card - Customer onboarding can be done entirely via the mobile App – a process taking less than 3 minutes",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"31587682.3632061",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/monaco-whitepaper.pdf",
       "startDate":"18/05/2017",
       "website":"https://mona.co/",
       "netHashesPerSecond":0,
       "totalCoinsMined":31587682.3632061,
       "twitter":{  
          "followers":59260,
          "link":"https://twitter.com/monaco_card"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":3902,
          "link":"https://www.facebook.com/MonacoCardOfficial/"
       },
       "code":{  
 
       }
    },
    "KMD":{  
       "ccId":"26132",
       "currency":"Komodo",
       "symbol":"KMD",
       "description":"Komodo is a privacy-centric cryptocurrency that combines the anonymity of ZCash with the security of Bitcoin. Using a new consensus mechanism developed by the Komodo team, delayed Proof of Work, Komodo blocks can be notarized using the Bitcoin blockchain. KMD is issued through an Equihash-based PoW protocol, and the new block information is sent to pre-voted notary nodes. These nodes insert the Komodo block information on the BTC blockchain by creating a custom transaction. This system ensures that in order to \"hack\" komodo, one would have to rewrite both chains.Komodo uses Zero Knowledge Proofs to provide 100% anonymous transactions, that are now secured with Bitcoin&#39;s hash rate.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Equihash",
       "proofType":"dPoW/PoW",
       "totalCoinSupply":"200000000",
       "whitepaper":"https://komodoplatform.com/wp-content/uploads/2018/03/2018-03-12-Komodo-White-Paper-Full.pdf",
       "startDate":"01/09/2016",
       "website":"https://komodoplatform.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"103706109.0",
       "twitter":{  
          "followers":78702,
          "link":"https://twitter.com/komodoplatform"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":15494,
          "link":"https://www.facebook.com/KomodoPlatform/"
       },
       "code":{  
          "stars":53,
          "language":"C++",
          "lastUpdate":"1519465553",
          "link":"https://github.com/jl777/komodo"
       }
    },
    "DNT":{  
       "ccId":"177175",
       "currency":"district0x",
       "symbol":"DNT",
       "description":"District0x Network is a collective of decentralized marketplaces and communities, hereafter referred to as districts.Districts exist as decentralized autonomous organizations on the district0x Network, built upon a standard open source framework comprised of Ethereum smart contracts and front-end libraries, hereafter referred to as d0xINFRA. d0xINFRA provides districts with the core functionalities required to operate an online market or community.The district0x Network Token can be used to signal what districts should be built and deployed by the district0x Project team and can be staked to gain access to voting rights in any district on the district0x Network.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1000000000",
       "whitepaper":"https://district0x.io/docs/district0x-whitepaper.pdf",
       "startDate":"01/01/0001",
       "website":"https://district0x.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":1000000000,
       "twitter":{  
          "followers":52418,
          "link":"https://twitter.com/district0x"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":82,
          "language":"Clojure",
          "lastUpdate":"1519316735",
          "link":"https://github.com/district0x/district0x-network-token"
       }
    },
    "MTH":{  
       "ccId":"208914",
       "currency":"Monetha",
       "symbol":"MTH",
       "description":"Monetha is a decentralized payment solution built on the Ethereum network. The Monetha solution leverages smart contract technology to provide a decentralized trust and reputation system in which sellers ratings are attatched to their respective transactions. The solution also enables merchants to accept ETH and Ethereum-based tokens which can be exchanged automatically into fiat currencyMTH is an Ethereum-based token that is used to pay for goods on Monetha. The value of the MTH token is based on its underlying assets, properties and/or associated rights. Monetha tokens also represent percentage share of revenue of Monetha project.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"402400000",
       "whitepaper":"https://ico.monetha.io/Monetha_WP.pdf",
       "startDate":"31/08/2017",
       "website":"https://www.monetha.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":402400000,
       "twitter":{  
          "followers":17454,
          "link":"https://twitter.com/Monetha_io"
       },
       "reddit":{  
          "subscribers":2036,
          "activeUsers":66,
          "link":"https://www.reddit.com/r/Monetha/"
       },
       "facebook":{  
          "likes":7161,
          "link":"https://www.facebook.com/Monetha.io/"
       },
       "code":{  
 
       }
    },
    "STEEM":{  
       "ccId":"20333",
       "currency":"Steem",
       "symbol":"STEEM",
       "description":"Steem.it is a blockchain-based social media platform where anyone can earn rewards by posting relevant content, curating quality content by upvoting and by holding Steem based currencies in a vest fund, which generates interest.There are three main currencies in Steemit: Steem, Steem Power (SP) and Steem Backed Dollars (SBD).Steem is liquid and can be bought in an exchange and converted into steem dollars or steem power.Steem Power is basically Steem that is locked in a vesting fund for 3 months. Users can use steem power to upvote content and get curating rewards.When a user upvotes content his steem power gets depleted and then slowly regenerated. Steem Power holders recieve interest from their holdings. The more Steem Power a voter has the more revenue he&#39;ll generate for himself (in form of SP) and for the content creator  (In SBD).There is also an incentive to upvote content early, as the rewards are distributed according to time. The earliest votes gets the biggest share of the reward.Steem Backed Dollars are there to protect content creators from volatitlity and can be traded for roughly 1 usd worth of steem, in order to cash out from steem. Converting Steem backed dollars into STEEM takes 5 days. Users also recieve interest from holding SBD. TSteem is a proof of work currency with a scheduled blocktime of 3 seconds. Steem PoW mining is done in rounds of 63 seconds by 21 miners (witnesses). 19 of the miners are pre voted, one is the other with the most computational power, and the last one is selected from a queue of witnesses that did not get on the top 19 voted witnesses.90% of the block reward is allocated to a vest fund to reward curators and PoW miners, the other 10% are made liquid in the form of steem and are used to reward content creators. Steem gets converted to Steem Backed Dollars and sent to the content creator. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"PoW",
       "totalCoinSupply":"99692126",
       "whitepaper":"https://steem.io/SteemWhitePaper.pdf",
       "startDate":"04/07/2015",
       "website":"https://steem.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"250588243.0",
       "twitter":{  
          "followers":87214,
          "link":"https://twitter.com/steemit"
       },
       "reddit":{  
          "subscribers":5936,
          "activeUsers":1825,
          "link":"https://www.reddit.com/r/steemit/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":1084,
          "language":"C++",
          "lastUpdate":"1519575815",
          "link":"https://github.com/steemit/steem"
       }
    },
    "EDO":{  
       "ccId":"310297",
       "currency":"Eidoo",
       "symbol":"EDO",
       "description":"Eidoo is a blockchain-to-human interface simplifying the interaction between the Ethereum and Bitcoin blockchains and its users. Eidoo is as a new blockchain asset experience providing an easy and secure way to buy, transfer, spend, and exchange cryptocurrencies without relying on any central authority. Eidoo offers all the tools and services required by users to fully manage their tokens and cryptocurrencies. It is a multicurrency and multiasset wallet; hybrid exchange; ICO Engine to participate in token sales; branded debit card and much more. Also, Eidoo supports all the ERC20 tokens automatically.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"90708327",
       "whitepaper":"https://eidoo.io/docs/EIDOO_Technology_White_Paper_v_0_2_Draft_EN.pdf",
       "startDate":"26/09/2017",
       "website":"https://eidoo.io",
       "netHashesPerSecond":0,
       "totalCoinsMined":90208327.58530745,
       "twitter":{  
          "followers":21827,
          "link":"https://twitter.com/eidoo_io"
       },
       "reddit":{  
 
       },
       "facebook":{  
          "likes":22559,
          "link":"https://www.facebook.com/eidoocrypto/"
       },
       "code":{  
 
       }
    },
    "BAT":{  
       "ccId":"107672",
       "currency":"Basic Attention Token",
       "symbol":"BAT",
       "description":"The Basic Attention Token is an Ethereum-based token that can be used to obtain a variety of advertising and attention-based services on the Brave platform, a new Blockchain based digital advertising system. User attention is privately monitored in the Brave browser and publishers are rewarded accordingly with BATs. Users also get a share of BATs for participating.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"1500000000",
       "whitepaper":"https://basicattentiontoken.org/BasicAttentionTokenWhitePaper-4.pdf",
       "startDate":"31/05/2017",
       "website":"https://basicattentiontoken.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"1000000000.0",
       "twitter":{  
          "followers":68430,
          "link":"https://twitter.com/attentiontoken"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "ARK":{  
       "ccId":"32699",
       "currency":"ARK",
       "symbol":"ARK",
       "description":"Ark is a cryptocurrency platform built on top an improved Delegated Proof of Stake (DPoS) system derived from Lisk, Crypti, and BitShares. It uses Smart Bridges to communicate with other (new and existing) blockchains to further increase its reach, providing a wider range of features in a single place.Ark plans to stimulate cryptocurrency mass adoption by offering multiple consumer tools like a card network, game tokens, anonymous transactions, multi-signature accounts, and others. Adding more features and tools along the way. ",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"DPoS",
       "proofType":"DPoS",
       "totalCoinSupply":"125000000",
       "whitepaper":"https://ark.io/Whitepaper.pdf",
       "startDate":"01/01/0001",
       "website":"https://ark.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"100875488.0",
       "twitter":{  
          "followers":59618,
          "link":"https://twitter.com/ArkEcosystem"
       },
       "reddit":{  
          "subscribers":20818,
          "activeUsers":1966,
          "link":"https://www.reddit.com/r/ArkEcosystem/"
       },
       "facebook":{  
          "likes":7904,
          "link":"https://www.facebook.com/ArkEcosystem/"
       },
       "code":{  
          "stars":151,
          "language":"JavaScript",
          "lastUpdate":"1519484934",
          "link":"https://github.com/ArkEcosystem/ark-node"
       }
    },
    "YOYOW":{  
       "ccId":"322002",
       "currency":"Yoyow",
       "symbol":"YOYOW",
       "description":"YOYOW is a Graphene based DAC for User Generated Content(UGC), focusing on the Chinese market at the first stage. The YOYOW coin is an asset issued on the BTS blockchain.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"62000000",
       "whitepaper":"https://yoyow.org/files/white-paper3_en.pdf",
       "startDate":"21/03/2017",
       "website":"https://yoyow.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":300000000,
       "twitter":{  
          "followers":7209,
          "link":"https://twitter.com/InfoYoyow"
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "STORJ":{  
       "ccId":"187347",
       "currency":"Storj",
       "symbol":"STORJ",
       "description":"Storj is a decentralized cloud storage platform that allows anyone to rent their idle hard drive space and to earn a revenue by doing so. Endusers can use Storj to store their files at competitive prices and within a p2p network that is secure from sever downtime, censorship and hacks. Payments within the Sotrj network and conducted with the STORJ token, an ERC20 Ethereum-based token.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"424999998",
       "whitepaper":"https://storj.io/storj.pdf",
       "startDate":"19/07/2017",
       "website":"https://storj.io/",
       "netHashesPerSecond":0,
       "totalCoinsMined":424999998,
       "twitter":{  
          "followers":78121,
          "link":"https://twitter.com/storjproject"
       },
       "reddit":{  
          "subscribers":6625,
          "activeUsers":2408,
          "link":"https://www.reddit.com/r/storj/"
       },
       "facebook":{  
          "likes":7206,
          "link":"https://www.facebook.com/storjproject/"
       },
       "code":{  
 
       }
    },
    "LUN":{  
       "ccId":"67447",
       "currency":"Lunyr",
       "symbol":"LUN",
       "description":"Lunyr is an Ethereum-based crowdsourced encyclopedia that rewards users with app tokens for peer-reviewing and contributing information, thus providing reliable, accurate information. The LUN tokens will be used to place ads on the platform. They function as part of the incentive system to drive contribution, peer review, and dispute and quality resolution. That platform itself is a crowdsourced decentralized knowledge base where contributors earn LUN tokens.Lunyr&#39;s mission is to develop solutions that fundamentally change the way we publish, store, and exchange information. Through the use of blockchain technology, we enable individuals to capture the world&#39;s knowledge in a medium that is ubiquitous, censorship-resistant, and immortal.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"2703356.0785",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/Lunyr-WhitePaper-ENG.pdf",
       "startDate":"08/03/2017",
       "website":"https://lunyr.com/",
       "netHashesPerSecond":0,
       "totalCoinsMined":2703356.0785315786,
       "twitter":{  
          "followers":31144,
          "link":"https://twitter.com/LunyrInc"
       },
       "reddit":{  
          "subscribers":2113,
          "activeUsers":2020,
          "link":"https://www.reddit.com/r/lunyr/"
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "RLC":{  
       "ccId":"61877",
       "currency":"iEx.ec",
       "symbol":"RLC",
       "description":"RLC is an Ethereum-based token used in the iEx.ec, a blockchain-based distributed cloud computing platform.  Developers can rent computing power, servers and data centers and make their unused resources available through a unique marketplace on the Ethereum blockchain. The RLC token allows users to rent servers, data and applications to execute their distributed applications.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":" 87000000",
       "whitepaper":"https://iex.ec/app/uploads/2017/04/iExec-WPv2.0-English.pdf",
       "startDate":"10/01/2017",
       "website":"http://iex.ec/",
       "netHashesPerSecond":0,
       "totalCoinsMined":86999784.9868455,
       "twitter":{  
          "followers":18955,
          "link":"https://twitter.com/iEx_ec"
       },
       "reddit":{  
          "subscribers":2682,
          "activeUsers":2013,
          "link":"https://www.reddit.com/r/iexec/"
       },
       "facebook":{  
          "likes":1458,
          "link":"https://www.facebook.com/iexecteam/"
       },
       "code":{  
          "stars":0,
          "language":"Java",
          "lastUpdate":"1473170516",
          "link":"https://github.com/gfedak/xtremweb-hep"
       }
    },
    "PIVX":{  
       "ccId":"42433",
       "currency":"Private Instant Verified Transaction",
       "symbol":"PIVX",
       "description":"PIVX is a privacy-focused cryptocurrency, currently in the PoS stage. PIVX uses the updated PoS 2.0 protocol and is based on Bitcoin core 0.10.x code base. It uses a network of masternodes for transparent decentralized governance and increased privacy.Click here for Masternode stats from masternodes.online.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Quark",
       "proofType":"PoW/PoS",
       "totalCoinSupply":"N/A",
       "whitepaper":"https://pivx.org/wp-content/uploads/2017/03/PIVX-purple-paper-Technincal-Notes.pdf",
       "startDate":"25/11/2015",
       "website":"https://pivx.org/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"55652209.0",
       "twitter":{  
          "followers":58348,
          "link":"https://twitter.com/_pivx"
       },
       "reddit":{  
          "subscribers":7592,
          "activeUsers":1832,
          "link":"https://www.reddit.com/r/pivx/"
       },
       "facebook":{  
          "likes":8714,
          "link":"https://www.facebook.com/PIVXCrypto/"
       },
       "code":{  
          "stars":239,
          "language":"C++",
          "lastUpdate":"1519566496",
          "link":"https://github.com/PIVX-Project/PIVX"
       }
    },
    "VIA":{  
       "ccId":"5015",
       "currency":"ViaCoin",
       "symbol":"VIA",
       "description":"Viacoin is a digital currency similar to Bitcoin that allows the creation of applications on top of the Viacoin blockchain in a similar way that email and web are built on top of the internet protocol. This allows the building of fully decentralized exchanges, issuing of new currencies, asset tracking, betting, digital voting, reputation management and even form the basis of fully decentralized market places. Our protocol for this will be called ClearingHouse.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"Scrypt",
       "proofType":"PoW",
       "totalCoinSupply":"23000000",
       "whitepaper":"https://viabet.io/viabetio_whitepaper_v1.pdf",
       "startDate":"18/07/2014",
       "website":"http://viacoin.org/",
       "netHashesPerSecond":56891841969123,
       "totalCoinsMined":22984837.96875001,
       "twitter":{  
          "followers":38789,
          "link":"https://twitter.com/viacoin"
       },
       "reddit":{  
          "subscribers":2079,
          "activeUsers":74,
          "link":"https://www.reddit.com/r/viacoin/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":56,
          "language":"C++",
          "lastUpdate":"1519492154",
          "link":"https://github.com/viacoin/viacoin"
       }
    },
    "ICN":{  
       "ccId":"25921",
       "currency":"Iconomi",
       "symbol":"ICN",
       "description":"Iconomi is an European based exchange that allows users to easily acquire Ether with EUR. Iconomi has recently expanded into a crowdfunded project, the Iconomi Open Fund Management platform. In the Iconomi OFM, users can choose between two investment types with different risk and profit levels, Coin Traded Funds (CTFs) and Coin Managed Funds (CMFs).Iconomi (ICN) tokens allow users to vote regarding the platform&#39;s development and they pay out dividends from the profits generated by the Iconomi OFM platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://coss.io/documents/white-papers/iconomi.pdf",
       "startDate":"25/08/2016",
       "website":"https://www.iconomi.net/",
       "netHashesPerSecond":0,
       "totalCoinsMined":100000000,
       "twitter":{  
 
       },
       "reddit":{  
 
       },
       "facebook":{  
 
       },
       "code":{  
 
       }
    },
    "WINGS":{  
       "ccId":"25946",
       "currency":"Wings DAO",
       "symbol":"WINGS",
       "description":"Wings is a platform where users can create and invest in Decentralized Autonomous Organizations (DAOs). These DAOs can be created without any specific coding knowledge or technical skills, and are approved through a prediction market feature. the Wings Platform is run by a DAO itself, the Wings DAO. Wings DAO tokens, WINGS, represent a share within that DAO and allows users to vote on the developments of the platform, and to recieve dividends from the fees generated within the platform.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"100000000",
       "whitepaper":"https://www.wings.ai/?whitepaper=1",
       "startDate":"31/12/2016",
       "website":"https://wings.ai/",
       "netHashesPerSecond":0,
       "totalCoinsMined":100000000,
       "twitter":{  
          "followers":37198,
          "link":"https://twitter.com/wingsplatform"
       },
       "reddit":{  
          "subscribers":1165,
          "activeUsers":69,
          "link":"https://www.reddit.com/r/WingsDAO/"
       },
       "facebook":{  
          "likes":2884,
          "link":"https://www.facebook.com/WingsDAO/"
       },
       "code":{  
          "stars":10,
          "language":"JavaScript",
          "lastUpdate":"1517582958",
          "link":"https://github.com/WingsDao/contracts"
       }
    },
    "BNT":{  
       "ccId":"22327",
       "currency":"Bancor Network Token",
       "symbol":"BNT",
       "description":"The Bancor Protocol is a blockchain-based system for discovery and a liquidity mechanism supporting multiple smart contract platforms. The flexibility of these blockchains allows tokens to be locked in reserve and to issue smart tokens on the Bancor system, enabling anyone to instantly purchase or liquidate the smart token in exchange for any of its reserve tokens.The BNT is the first smart token on the Bancor system and it will hold a single reserve in Ether. Other smart tokens, by using BNT as one of their reserves, connect to the BNT network. The BNT establishes network dynamics where increased demand for any of the network’s smart tokens increases demand for the common BNT, benefiting all other smart tokens holding it in reserve.",
       "features":"",
       "assetType":"",
       "hashAlgorithm":"N/A",
       "proofType":"N/A",
       "totalCoinSupply":"79323978",
       "whitepaper":"https://bravenewcoin.com/assets/Whitepapers/Bancor-Protocol-Whitepaper-en.pdf",
       "startDate":"13/02/2017",
       "website":"https://bancor.network/",
       "netHashesPerSecond":0,
       "totalCoinsMined":"39105404.0",
       "twitter":{  
          "followers":576,
          "link":"https://twitter.com/bancor"
       },
       "reddit":{  
          "subscribers":4075,
          "activeUsers":2172,
          "link":"https://www.reddit.com/r/Bancor/"
       },
       "facebook":{  
 
       },
       "code":{  
          "stars":360,
          "language":"JavaScript",
          "lastUpdate":"1519585279",
          "link":"https://github.com/bancorprotocol/contracts"
       }
    }
 }